[{"id":"81a885d6-8f68-5bc0-bbbc-1c7b32e4b4e4","title":"Need a Little Help with Your Site? Hire a Corvid Web Developer","content":"Here at Wix we strive to support you with this community forum, API references, articles, videos and code examples. But sometimes you might need a little extra help to get your site exactly the way you want it. \nHire a developer from the Wix Arena, an online marketplace with top Corvid web developers from around the world. Submit your project details here, and we’ll find the right professional for you.","userEmail":"jug@nesetal.af","creationTime":1542111235544,"labels":["Corvid","Api"]},{"id":"36043e94-6d21-5d2a-b1eb-f983996e3d79","title":"Wix Code Forum - Guidelines for posting a question","content":"Hi Wix Code community, me again :)\n\nOver the past few weeks, we've discussed ways to make forum questions more accurate, professional and easy to answer to. This is super important, as this helps us be an ever-growing community, where we help one another achieve any goal that comes to mind, regardless of their coding level.\n\nHere's what we came up with:\n\n- Be nice. We love the atmosphere, and we love seeing how much everyone enjoys helping one another. We firmly believe that we should safeguard this culture—this is our space and we should protect it. We have different skills and  different challenges, so don't forget that each one of us was once a code baby :)\n- Do not repeat questions. Use the forum search. There's a great chance that someone has already solved the problem that you are facing. \n- Use meaningful titles. ‘How can I create a collapsing and expanding repeater?’ is a much better title than ‘Help please!’. This makes it easier for people to spot the posts that they can help with.\n- Use Hashtags. makes it #easy #to #follow #topics.\n- Multiple short posts are better than a long one. This allows other people to benefit from our posts after we're done with it. Keeping posts short makes it easy to find answers, and makes the post relevant for more people.\n- Keep questions focused and clear. This will make each question easier to solve, which makes it possible for more people to answer it.\n- Format the text in your question. Use Code blocks, bullets, etc. to make it easier to understand.\n- Refrain from posting a long code. Debugging code is difficult enough when it's a short one. Post only relevant part of code.\n- Provide as many details as possible. Share what you think is right, what you’ve tried to do, and what blocks you. Include any relevant screenshots, code, and URLs to make it easier for others to understand the problem.\n- Acknowledge our peers’ help by marking a 'Top Comment' for the best answer. This will also make it easier to spot the correct answer.\n\n\nLast but not least: WORK HARD, PLAY HARDER!. Have fun in the process ;)\n\n","userEmail":"kekikum@segtaj.gh","creationTime":1545880457898,"labels":["Corvid","Guidelines"]},{"id":"ab6fc754-0e01-5cfb-84b9-cf37c1c0cdb5","title":"Collapse/expand code affecting the page footer\n","content":"I have placed collapse/expand code onto one of my pages, but the footer now has a huge white space above it in the preview. Is there a way to fix this?","userEmail":"susjorna@jep.sa","labels":["Collapse","Expand"],"creationTime":1517833093439},{"id":"82150d9f-f12c-5545-8329-6eaa80cb9ebd","title":"How to Display Numbers with a Comma Separator","content":"Hey Guys, \n\nStruggling with understanding how to get my code to display commas. While I know its been attempted to be answered before my situation is a bit unique I think. \n\nIn my my database I have both text and numbers (different columns). The numbers are inputted as 0000.00, but displayed with a comma within the database. When I tried to use this code: \n \n$w.onReady(function () {\n\n  $w(\"#dataset1\").onReady(() => {\n var number = Number($w(\"#table1\").text);\n    $w(\"#totalDealValue\").text = number.toLocaleString();\n\n  });\n\n});\n\nIt stated \"text does not exist for table1\" and \"totalDealValue is not a valid selector\"\n\nI'm not sure how to select a particular column within the dataset to display the information within the column with a comma. \n\nany help would be appreciated. Still learning to code!\n\nBest,\nGabe","userEmail":"co@ac.na","creationTime":1514870853599},{"id":"b52ad1dc-937b-54c3-81e9-2d433dd96bf6","title":"setting up my login page profile","content":"Hi there!\n\nI just want to ask how to fix my problem regarding on my login page.\n\nI watched and followed a tutorial on how to make database and a login page, here's what I have done following the tutorial, I did not mean to say it is wrong but I think I lack of something that I cannot decode on myself and I have a hard time looking since I am not sure what it is.\n\nHere is what I did:\n\n* Database collection\n* A pagecontent where there is:\n\nFirst Name\nLast Name\nEmail\nUpload Profile\nAbout Me\n\nThis page is connected to my database which I did right\n\n* I made a dynamic page wherein it will show the content that I will write from the page content I mentioned above. If I will not write information on that page content, my dynamic page will be blank.\n\nAfter I created a database, a page and a dynamic page, I, then created the login/logout page using codes.\n\nMy concern is this, once I click on my profile, instead of going to my dynamic page, it should be on my page content. Once I put information on that page, then it will show my dynamic page.\nHow can I, or what should I do with that?\n\nThank you for the answers.\n","userEmail":"cube@zo.lv","creationTime":1523581514366,"labels":["Login","Problem","Tutorial"]},{"id":"42c22972-8daa-5305-9885-659616df6e18","title":"Corvid App Developers Alpha?","content":"I could have sworn that I saw reference to a new system that was in alpha testing that would allow developers to add a module to their Corvid developers system that would let them save apps, pages and widgets to help move them between sites. Now, I can't find what I remember reading. Anyone know what I am referring to?","userEmail":"ozipagren@ihu.jm","creationTime":1533526556410},{"id":"7091aeb2-cbf4-504f-8ce6-dee773212074","title":"View Count & Click Count","content":"Hey there,\n\nI have resorted to here, to see if someone can simply help me (it would be greatly appreciated if you could give me your help on this piece of code). I have been trying for a day now, with no luck to get this to work. \n\nI am building an advertising system, which displays adverts across my website. Mostly using repeaters - the ads are stores in an 'Adverts' database - where i can use tags to also control the placement. \n\nI need to be able to do the following:\n\nUpon an Advert being clicked within a repeater, update the Database item click count field which field key would be 'clicks'. \nUpon an Advert being viewed (scrolled over) update the Database item view count field which field key would be 'views'\nOR....update the 'view' count field based on a page being loaded with a repeater/repeater item being on it - if the above is more complex in some way.\n\nHope this makes sense and i would be really grateful for someone's help on this. Much appreciated.\n","userEmail":"an@nagla.gh","creationTime":1535681533617,"labels":["View Count"]},{"id":"e35f54a8-8794-5d1e-915d-202138500e9b","title":"Bold numbers in automated text","content":"Hi, I have a site where when the user selects from multiple drop down menus they get a result. How can I make it so that the a and b values below are bolded?\n\nexport function text_a_b(a,b){\n var Amin = session.getItem(\"Amin\");\n var Bmax = session.getItem(\"Bmax\");\n    $w(\"#resA\").text = \"If you enroll by October, you are estimated to pay between $\" + a + \" and $\" + b + \" per month\"; \n\n}","userEmail":"marfetlub@wopol.as","creationTime":1543752057872},{"id":"4a8e9c43-4acb-5e3b-b045-b5beb57f9e10","title":"Invoke a delete confirmation lightbox from another lightbox","content":"I have a lightbox that queries a collection and populates a table which is linked to a dataset. When a user selects a row in the table, I want to open a second lightbox \"Delete Verification\" asking the user to confirm deleting the item.  The user selects either a Yes button or a No button which closes the \"Delete Verification\" lightbox and sets a data variable called \"confirmed\" to a value of either \"yes\" or \"no\". \nThen, the first lightbox checks this return value and if \"yes\" it calls the dataset1.remove function.\n\nThe problem is the \"Delete Verification\" lightbox does not open. Here is the pertinent code.  Note: the \"Delete Verification\" lightbox is called from several pages and it works fine. It just doesn't open when called from this particular lightbox.\n\nexport function table1_rowSelect(event) {\n //delete the selected row\n let tableRowIndex = event.rowIndex;\n    console.log(\"tableRowIndex = \" + tableRowIndex); // 2 if the third row selected\n \n //ask user to confirm before deleting the item\n    $w(\"#dataset1\").setCurrentItemIndex(tableRowIndex) // sets the dataset rowIndex\n      .then( () => {\n        console.log(\"open the lightbox asking user to confirm deletion\");\n        (wixWindow.lightbox.open(\"Delete Verification\"))  //########## THIS LIGHTBOX DOES NOT OPEN #########\n             .then( (data) => {\n let userAction = data.confirmed;\n                 console.log(\"userAction = \" + userAction);\n if (userAction === \"yes\") {\n                    $w(\"#dataset1\").remove();\n                }\n             })\n \n      } );\n}\n\n","userEmail":"di@modude.mc","creationTime":1543815282858},{"id":"7181cec4-cf43-5936-a75b-c1d5f8a7e00e","title":"twilio resister otp not work","content":"\nhi \ni'm newbie/beginer to buid webside\ni want to use sms authentication mobile number\nfor newuser register\n\nnow fucntion don't work\n\nplese help me fix this\n\nthank you\n\n(sorry for english)\n\n\n\n\n\n \n\n\n","userEmail":"zorjubuw@us.mh","creationTime":1528964107501},{"id":"34cf1686-2c1c-54da-9d45-e64fa270422f","title":"Fetch BLOCKED by CORS??","content":"I'm experiencing the following error when trying to use my POST function from another Wix site.\n\nAccess to fetch at 'https://www.mitchwagnerdesign.com/_functions/csv' from origin 'https://www.bedminsterptg.com' has been blocked by CORS policy: No 'Access-Control-Allow-Origin' header is present on the requested resource. If an opaque response serves your needs, set the request's mode to 'no-cors' to fetch the resource with CORS disabled.\n\nPlease help me figure out why 'Access-Control-Allow-Origin': '*' is not covering this.\n\nhttp-function on https://www.mitchwagnerdesign.com\nexport function post_csv(request) {\n let options = {\n        headers: {\n 'Access-Control-Allow-Origin': '*',\n 'Content-Type': 'application/json'\n        }\n    };return request.body.json()\n        .then((body) => {\n            body.expirationDate = new Date(new Date().getTime() + (24 * 60 * 60 * 1000))\n return wixData.insert(\"CSVExportData\", body, {\n \"suppressAuth\": true,\n \"suppressHooks\": false\n            });\n        })\n        .then((results) => {\n            options.body = {\n \"_id\": results._id,\n \"url\": \"https://www.mitchwagnerdesign.com/_functions/csv/\" + results._id,\n \"expiration\": results.expirationDate\n            };\n            console.log(\"RETURNING DATA\")\n            console.log(options)\n return created(options);\n        })\n // something went wrong\n        .catch((error) => {\n            options.body = {\n \"error\": error\n            };\n return serverError(options);\n        });\nCalling the Method from https://www.bedminsterptg.com\nfetch(\"https://www.mitchwagnerdesign.com/_functions/csv\", {\n            method: \"post\",\n            headers: {\n \"Content-Type\": \"text/plain\"\n            },\n            body: '*******PRIVATE*DATA*REDACTED********'\n        })\n        .then((httpResponse) => {\n            console.log(\"REQUEST SENT\");\n if (httpResponse.ok) {\n return httpResponse.json();\n            } else {\n                $w(\"#buttonDownload\").enable();\n return Promise.reject(\"Fetch did not succeed\");\n            }\n        })\n        .then((json) => {\n            console.log(json);\n            wixLocation.to(json.url);\n            $w(\"#buttonDownload\").enable();\n        })\n        .catch((err) => {\n            console.log(err)\n            $w(\"#buttonDownload\").enable();\n        });\n","userEmail":"bep@dov.sh","creationTime":1524338473695},{"id":"a08ded46-92b0-52f5-bdd2-b7ccb700829b","title":"Multiple GetJSON without response","content":"Hello everyone,\n\nI'm trying to sync between a software and the wix database but I have a problem when I try to make several requests. \n\nHere is my code: https://www.codepile.net/pile/zAY0d4ao\n\nHere the input in console.log :\npage : 0 loading\npage : 0 loaded\npage : 1 loading\nWhy page 1 is not loaded ? \n\nThe url is correct, no error detected.\n\nAn idea of the problem ?\n\nThanks,\n\nYannik","userEmail":"mowa@puzoigi.my","creationTime":1527845968004},{"id":"820b51bc-1bcc-581a-88ae-f502e2cecd8b","title":"CONFIRMED BUG: Background video fails to load with errors 403 and CORS","content":" \nI can change with code page backgrounds with images but not with videos using $w(Document).background.src\nI'm talking about changing between stock Wix background videos in the Wix video manager, not external videos.\n\nSo with the API one can obtain the URLs for images and videos and they look like these:\nwix:image://v1/8034aa3291a54c489a7b7a3121d994f9.png/Bananas.png#originWidth=1177&originHeight=1200\n\nwix:video://v1/11062b_03c50f8fe4a34cc297a984e483a282ef/_#posterUri=/11062b_03c50f8fe4a34cc297a984e483a282eff000.jpg&posterWidth=1920&posterHeight=1080\n\nI store the URL in session storage and then reload the page.\nThen I can change the page background with this code inside the onReady():\n\n$w(\"Document\").background.src = \"wix:image:// ...\";\n\n$w(\"Document\").background.src = \"wix:video:// ...\";\n\n\nWorks for images, fails for videos.\nChrome just fails with this:\n\n \nThis lead me to believe that the URL for the video was bad.\nI spent too much time looking, testing and looking some more for an answer.\nFinally, using MS Edge, I got two different error messages that were helpful:\n\n \n and occasionally: \n \n Plugging one of the Wix video URLs into Chrome gives this 403 error: \n \nSo I have to conclude that Wix/Corvid is not allowing my Wix pages to access stock Wix videos in the Wix video manager - which should be an error on the Wix/Corvid end, not a feature.\n\nHere is a test page so you can see the error messages when requesting a change of video background:\n\n(use Chrome or MS Edge and look at console - FireFox has an error message that blocks the other messages)\nhttps://www.ualmatrix.com/clock-minimal-image \nAfter initial load click the \"Show URL\" button first so you can confirm the current video URL.Then select backgrounds from the \"Theme\" dropdown list.\nNote that the images work (page reloads and changes background image inside the onReady() ), and the videos have various failures:\nSometimes they fail with a 403 message and no backup image, and others show the backup image without an error message.\nOccasionally a CORS error pops up too.\nFull URL for Wix video background \"Ocean\"\nwix:video://v1/11062b_95d34f15761e4114a57b17823228948e/_#posterUri=11062b_95d34f15761e4114a57b17823228948ef000.jpg&posterWidth=1920&posterHeight=1080\n\nApparently, that gets converted internally by the Wix server to:\nhttps://video.wixstatic.com:443/11062b_95d34f15761e4114a57b17823228948e/1080p/mp4/file.mp4\n\nAnd since Wix thinks thinks my Wix page should not have access to that URL, it loads the poster instead (some files do and some don't):\n_#posterUri=11062b_95d34f15761e4114a57b17823228948ef000.jpg&posterWidth=1920&posterHeight=1080  \n\nTo summarize the dilemma:\nIf my Wix/Corvid pages can change stock Wix background images, then the same should also apply to stock Wix background videos. Instead, the video URLs are blocked, resulting in a 403/CORS error.\n\nSince videos are bandwidth intensive, I can see why Corvid would be careful with them, but it seems they went a bridge too far when a Wix/Corvid page cannot access Wix/Corvid stock videos.\n\nMaybe I'm overlooking something I can do on my end, but this looks very much like a problem on the Wix end of things.\n\nWix/Corvid has server settings that allow page background image changes in the onReady() part of pages. But, it prohibits page background videos to be changed the same way as the images.\n\nLooks like a Wix/Corvid system error to me (or a flawed policy), not a feature.\nSince this is a suspected bug, I sent it to tech support.\nThey told me to place the concern in the forums - the usual circular reference games.\n\nAny assistance with this matter is greatly appreciated. \n","userEmail":"rujruvjiv@uw.mx","creationTime":1526445637085},{"id":"6358ae3f-0eb4-5bea-aae2-dd358e0c3988","title":"Dynamic Header","content":"I was hoping that someone would know how to make a header resize once scrolling. \n \nThis would be the main header (at the top of the page). Once scrolling, the logo would switch to this:\n\n \nPlease ignore that the header buttons on the right side are different.\n\nCan anyone help me out?!\nJon","userEmail":"icuansug@vazi.ma","creationTime":1545448296597},{"id":"a9b525d4-0e89-5bae-a3dd-96dbad69f5d8","title":"Wix code not working in Safari?","content":"Can anyone tell me why Wix code is failing to work in Safari? Works great in Chrome and Firefox.\nIf they're writing a coding system (sort of closely related to javascript) why it should not work on all platforms?\nReally need this to work ASAP. Just launch a corporte site that worked last week but not now???","userEmail":"won@lusdagsuw.ke","creationTime":1526121084533},{"id":"a20f3897-5d05-5853-9441-b006748969b1","title":"Debug wix code in Chrome Developer Tools","content":"Hi, \nI'm trying to put breakpoint in the code I wrote for a page and I'm following the instructions like this \"Loading the code for the YourPage page. To debug this code, open pqbzj.js in Developer Tools.\".\nUnfortunately is not clear where I could find this file. In the Sources tab I looked in all the nodes but I don't see the file. Could you please explain to me where can I find it? \n \n","userEmail":"fe@kuedjev.ma","creationTime":1530408178692},{"id":"a28963ee-6fc6-59be-a871-3cea2941deab","title":"Trigger Different Lightboxes According to Time of Day","content":"Hi,\n\nI would like to display a different lightbox according to the time of day a user is on the website.  For example, I would like to display a breakfast special until 10:30 am, a lunch special from 10:30 to 1:30 pm, and an afternoon wine special from 1:30 to 4:00 pm.\n\nCan somebody outline a script I could modify for this purpose.  I am brandnew to both Wix and Corvid.\n\nMany thanks.\n\nTed","userEmail":"reglensug@zo.tk","creationTime":1545177212164},{"id":"0b981848-fced-5024-821d-87aefdc85be1","title":"build a personalized feed for each user","content":"Hi Corvid community, I'm trying on my site to allow members to follow each other. I followed the different posts on this forum, I managed to create a database that allows me to know who follows who. \n\nNow I would like to allow the site members to be able to follow the activities of the people they follow. For this purpose, I have a database with all the data from these members! \nBut I find myself stuck, I can't customize the repeater so that it only displays the activities of the people being monitored. I don't know how to connect all the databases to make a perfect feed for my users !\n\nI hope you can help me !  \nThank you in advance, and great job for the forum! \n\n","userEmail":"tondikavu@ru.am","creationTime":1542292889192},{"id":"dea10b2a-6cd3-5aea-bcd0-5ba478753740","title":"Using InsertReference() for following functionality .weird error, field error?!","content":"okay so essentially I want to add my current user that is logged into a multi reference field of another user once they press a follow button on that users profile.\n\nSo if I want to follow your account, I am trying to use insertReference() to insert a reference of my profile item into the followers field in your item. \n\nHere's my current code.\n\n I iterate through each item in the repeater and set its individual components to build the individual users \"mini profile\"\n\nitemdata refers to the current item.\n\n$w(\"#repeater2\").forEachItem(($item, itemData, index) => {//repeating user\n \n let belt = itemData.belt;\n\n let a=\"  | | | |  \";\n if (itemData.stripe===\"0\"){     a=\"`````````\";}\n else if (itemData.stripe===\"1\"){a=\"`|```````\";}\n else if (itemData.stripe===\"2\"){a=\"`| |`````\";}\n else if (itemData.stripe===\"3\"){a=\"`| | |```\";}\n else if (itemData.stripe===\"4\"){a=\"`| | | |`\";}\n\nhere i'm setting their profile up. nothing special\n            $item('#repeatedName').text=itemData.name;\n            $item('#repeatedProfilePic').src=itemData.photoProfile;\n            $item('#repeatedContainer').src=itemData.photoCover;\n            $item('#repeatedBoxBelt').style.backgroundColor = session.getItem(belt);\n            $item('#repeatedStripes').text = a;\n \n            $item('#repeatedFollowButton').onClick((event)=>{\nwhen the button is pressed i call the following function which i have created and i pass in the current profiles itemData\n                followUser(itemData);\n            });\n        });\n\n\nexport function followUser(itemData){\n //must add current user(logged in user) to selected users followers\n //inserts a reference to the item with ID of the current user in the followers field of the item in the USER_ProfileData collection with the ID of the selected user(the one the current user wants to follow).\n\n    wixData.insertReference(\"USER_ProfileData\", \"followers\", itemData._id, wixUsers.currentUser.id)\n    .then( () => {\n        console.log(\">Reference inserted \");\n    } )\n    .catch( (error) => {\n\n        console.log(error);\n    } );\n}\n\nWhen I press the follow button I am getting the following printed to the console.\n\n Error: Provided relationshipAttribute [followers] is not a multi-reference field. \nThe field is in fact a multi reference field...\n\njust in case you want to look around. HERES THE LINK!\nwww.grapplehub.net\n\nTHIS PROBLEM HAS BEEN BUGGING ME FOR A LONG TIME!! ANY ADVICE IS VERY MUCH APPRECIATED!\n\n\n","userEmail":"kuebemic@ufvewed.gi","creationTime":1538861834942},{"id":"55d23494-5230-5213-a36d-5273ab4f3223","title":"Making a dynamic sum based on user ","content":"Hey guys, \n\nwell, this one might be complicated to explain. I have a members area where I use a dynamic page to display campaigns. Each time a person completes a campaign would get assigned a number of X points. These points are to be displayed in their account page.\n\nIn order of events: \n\n- A campaign is displayed\n- Participant completes the campaign\n- Points are assigned (based on the field containing the campaign points()\n- Points are added (from all completed campaigns) \n- Sum of points is displayed in the account page of the user. \n\nI'm completely lost on where to start building here. Please help!\n","userEmail":"vireel@jobhul.cy","creationTime":1535726898499},{"id":"ae280839-eef6-5761-ac6d-0e712b1e7d64","title":"Controlling repeater load","content":"Hi, How can i set my repeater to load each time 4 items when i scroll down? like in this web site:\n https://eduardo.nadlan-neto.net/he ","userEmail":"zuj@ujko.cf","creationTime":1515301356700},{"id":"e469d55a-177b-5e12-b5a8-4daa485c5502","title":"Integrating wix' and the hotels' booking systems","content":"Hi all\n\nDoes anybody know whether it is possible to add a booking system, so that users can book different hotels from my wix website?  \n\nHow do I intergrate wix' and the hotels' booking system?\n\nHope that you can help! \n\nThanks....","userEmail":"kislef@zot.bd","creationTime":1539710180699},{"id":"ee83ff74-cac2-598a-97c3-52ca22b6f5ab","title":"Link database to services\n","content":" \nHello!\nI'm looking for an orientation. If I'm not in the proper place feel comfortable to delete.\nI want to create a plataform or something in this way where I could connect a service to a visitor; acting between many professionals that will constantly update their content and possible clients (visitors until then), intermediating both.\nSo for that I was thinking in use a database linked to dynamic pages and offering a possibility to the visitor to hire that service in a automated way through the website.\nIs that a possible and good a ideia to do in the plataform? Do you suggest using Corvid for any function or the editor is enough? It should fit well in a member's area? Suggestions are very welcome. https://192168ll.onl/ https://xender.vip/ https://testmyspeed.onl/\nThanks in advance!","userEmail":"he@cud.mc","creationTime":1518074759400},{"id":"ed306501-3902-5e54-b645-2fc213695373","title":"How to code a button to redirect users to another page when clicked","content":"Hi, I am wondering how I would be able to code a button using the coding feature in corvid to redirect a user to another page on my website. I've looked around and have tried a lot of stuff to no avail. This is in attempt to find a solution to the issue where users are not redirected to another website page after submitting a payment forum, which I understand is a current issue being worked on. \n#code #button #easy ","userEmail":"zadazid@rekucu.gs","creationTime":1534757469383},{"id":"bf2b4e4a-8194-5ee6-8536-5dba6e952dd0","title":"User button upload limited dimension and refresh","content":"Hi everyone,\nI am trying to write the code to limit the size of the image file that User can upload and refresh the photo after loaded. \nCan you please tell me where I'm wrong and what's missing? In fact doesn't works good and show me problem with \"size\"\n\nThanks in advance, as always\n\n\n \nexport function BBrochureUpload_change(event) { .    //button to upload event\n let mySizeLimit = 2000;     //Mb limited\n let files = $w(\"#BBrochureUpload\").value;       //button to upload\n let fileSize = files[0].size;\n if (fileSize < mySizeLimit) {\n        $w(\"#BBrochureUpload\").startUpload()\n        .then((uploadedFile) => {\n                        $w(\"#image1\").expand();       // images show after upload\n                    })\n                    .catch((uploadError) => {\n                        console.log(`File upload error: ${uploadError.errorCode}`);\n                    });\n            } else {\n                $w(\"#image1\").collapse();    \n                $w(\"#TLimited\").show();    // write \" Image to large to upload\"\n   }\n","userEmail":"ocuvu@nur.mx","creationTime":1524696676869},{"id":"ae80d629-3339-582f-b80d-1a2003109f16","title":"Calling a module from job scheduler","content":"Hi\n\nI made a jobs scheduler and I need it to use a module (.jsw), not a .js because I want to send data threw Zapier once a day.\n\nis it possible?\n\n-----------------------------------\njobs.config:\n \n{\n \"jobs\": [\n    {\n \"functionLocation\": \"/dailyReport.report\",\n \"description\": \"daily report\",\n \"executionConfig\": {\n \"time\": \"11:14\"\n      }\n    }\n  ]\n}\n\ndailyReport.jsw:\n\n \nimport {usewebhook} from 'backend/useWebhook.jsw';\nimport wixData from 'wix-data';\n\n\nexport function report (){\n let data = {\"data\": \"something\"};\n let url = \"https://hooks.zapier.com/**********\";\n\n    usewebhook (data, url);\n}\n","userEmail":"rovtimov@epasfo.gh","creationTime":1529587395310},{"id":"fb09f153-aafd-5e8a-8062-0a2a1a92772c","title":"https://healthcircle365.com/iron-core-edge/","content":" Iron Core Edge  By no means snort at his makes an attempt to make you completely happy, don't shaggy dog story with male capabilities and sizes - this is essentially Iron Core Edge most painful situation for Iron Core Edge fundamental ideas of riskless sex. Who argues that his physiognomy at Iron Core Edge time of Iron Core Edge seek for that very cherished point or in an try to unbutton a bra explanations you to have probably Iron Core Edge most tender feelings? Don't make fun of your ex! It most effective appears that this passion should be flattered, but actually he will think that at some factor he'll also grow to be an “ex”, after which you're going to snigger at him in Iron Core Edge same method. And, oddly enough, you will have to not snigger immediately, even if you remembered whatever very humorous. It is not likely that you will prove Iron Core Edge MCH that didn't snigger at him, but for those who prove it, he will still be very offended! In any case, alternatively of having fun with what is going down, you believe of some thing wholly one of a kind. Probably Iron Core Edge most passionate fish there's a style of decorative fish, often called \"kissing gourami.\" At these voluptuous individuals Iron Core Edge kiss can last Iron Core Edge entire 25 minutes! Essentially Iron Core Edge most indecent library Iron Core Edge older new release could resent Iron Core Edge contents of Iron Core Edge shelves of bookstores, but they are unlikely to grasp that essentially Iron Core Edge most vast collection of books about intercourse is contained in Iron Core Edge Vatican library. Iron Core Edge gathering has 25,000 volumes. Iron Core Edge strangest bride in some parts of South India is still preserved custom prohibiting Iron Core Edge younger brother to marry earlier than Iron Core Edge older. For this reason Iron Core Edge tradition that deceives this tradition has been preserved: to solemnly mix Iron Core Edge wedding of an elder brother with a tree (or with Iron Core Edge spirit residing within Iron Core Edge tree). Probably Iron Core Edge most ridiculous contraception An absolute document holder in phrases of extravagant approaches of contraception may also be viewed Iron Core Edge Greek health care provider Soran.  \n https://healthcircle365.com/iron-core-edge/ ","userEmail":"imguhiz@milzi.tf","creationTime":1545399819648},{"id":"5ddec3bf-9409-514f-8538-0113498d3f57","title":"Cannot change Content-Type of the response from backend http function","content":" I have a http post function in the backend of my site and i would like it to return text/html as the Content-Type which i have set in the options. Although when I call the function the responses Content-Type is application/json.\n\nBelow you can see my code\n \nexport function post_acsexit(request) {\n\n let options = {\n \"headers\": {\n \"Content-Type\": \"text/html\",\n        },\n \"body\": \"<html><body>tt</body></html>\"\n    };\n \n return ok(options);\n}\n","userEmail":"luderog@izu.mp","creationTime":1516143383861},{"id":"6adf3f03-1560-5c18-87d8-261e1aff7e3c","title":"Is Corvid down for editors? ","content":"Is there an issue with Corvid at the moment, unable to call any databases or add new ones in the editor currently. \n\nThanks \nChris Silvester ","userEmail":"jezgek@tokcu.be","creationTime":1538131141483},{"id":"11d0c998-870c-5f0c-abb9-20b2e7f53d93","title":"Share website template through link ","content":"Hi all, sorry if this question is kinda basic but I was wondering if it’s possible to share my site template to another Wix user through my editor link?\n\nI’ve seen a few admins do this so I do know if it’s only exclusive to them\n\nSimply copy pasting my editor.wixsite.com/html/editor/{ID}  to my desired account doesn’t work","userEmail":"sitfopi@seja.lb","creationTime":1528600849750},{"id":"2c9943e6-dc6a-5335-81fd-520b3774f68a","title":"Pause slideshow (Stop the loop)","content":"Hello. I'm trying to do what the OP was asking for on this thread:\nhttps://www.wix.com/corvid/forum/community-discussion/stop-this-slideshow\n\nUnlike him, I AM using the standard slideshow feature, and identical to him, would like the slideshow to stop after the 3rd slide and not continue to loop.\n\nI used the code suggested, and changed my id:\n$w.onReady(function () {\n    $w(\"#heroslider\").onChange((event, $w) => {\n let currentIndex = event.target.currentIndex; // 3\n \n if(currentIndex === 3){\n            $w(\"#heroslider\").pause();\n        }\n    });\n});\n\n\nHowever, the code is not working.\nSince the discussion on the previous thread continue to fix a Gallery issue, I'm re-starting this question to ask for help troubleshooting the slideshow issue. \n\nThank you!\n\n","userEmail":"zulmuw@ra.mx","creationTime":1541961841343},{"id":"04ab5c1c-b400-5977-8fd1-d41aacf3b22c","title":"Automatic custom payment return to the customer","content":" Adding a payment to access members area for online training.  This will allow me to upload videos that are accessible for 24 hours for monthly challenges.  Challenges last 28 days and Participants can register through paying  £28 per challenge with a refund of £8 upon completion of the challenge, as long as the website records that participant taking part for the whole session for the full 28 days – this should activate a refund of the £8. Is it possible in Wix via code ??","userEmail":"fufvom@reropa.gy","creationTime":1536536894459},{"id":"1dc76c3b-00dd-5d28-9515-c730ff516980","title":"Find and Replace text for product description","content":"Is there a way for me to search for a specific word throught all the product descriptions on my store, and replace with another word?","userEmail":"conpi@in.th","creationTime":1539565427013},{"id":"61015c38-e47d-56f0-b176-2b75b74ff113","title":"Hide Mini Cart when using addToCart( )","content":"Is it possible to hide the Minicart from opening every time an add to cart button is clicked on a repeater page ? Surely this should be simple to allow us to do with code but I can't seem to find any info on what the element #minicart is to hide.","userEmail":"cizo@powinuf.ao","creationTime":1521419757624},{"id":"f713c784-0783-5160-a8e4-9b8f299462d5","title":"Failed to load initial data Error: {\"message\":\"value Some(150) for paging.limit is not valid\",\"details\":{}}\n","content":"Suddenly getting this error pop up when changing the dataset number to display setting.\n Failed to load initial data Error: {\"message\":\"value Some(150) for paging.limit is not valid\",\"details\":{}}\n It is for a custom product collection repeater. \n Have tried to adjust the number of items to display in the dataset settings but it only works for under 100 products. Any ideas if it can work for more than 100?","userEmail":"apuoh@di.tg","creationTime":1523703671573},{"id":"1b082477-575e-52d5-8841-9fce75e2d6df","title":"How to let SearchValue from Url","content":"Hi everyone, I am a  newbie to using Wix Corvid.\nI would like to set coding from http:// domain.com/coverage?query= \"word\"\nthan the result will out put to repeater in same page, the \"word\" will show off on search bar.\n\nmy edit coding in following, please help and thx a lot\n\n \nimport {local} from 'wix-storage';\nimport wixData from 'wix-data';\n\n$w.onReady(function () {\n\n var sameWord = local.getItem(\"searchWord\");\n\n    $w(\"#input1\").value = sameWord;\n    $w(\"#input1\").placeholder = sameWord;\n    $w('#dataset1').onReady(function () {\n\n        search();\n    });\n\n});\n\n\nexport function searchButton_click() {\n\n    search();\n\nlet SearchValue = $w(\"#input1\").value;\n$w(\"#dataset1\").setFilter(wixData.filter().contains('subTitle', SearchValue).or(wixData.filter().contains('zone', SearchValue).or(wixData.filter().contains('description', SearchValue))));\n}\n \nfunction search() {\n\n    wixData.query('name')\n   .contains('name', $w(\"#input1\").value)\n   .or(wixData.query('name').eq('description', $w(\"#input1\").value))\n\n      .find()\n       .then(res => {\n  $w('#repeater1').data = res.items;\n\n    });\n\nlet SearchValue = $w(\"#input1\").value;\n$w(\"#dataset1\").setFilter(wixData.filter().contains('subTitle', SearchValue).or(wixData.filter().contains('zone', SearchValue).or(wixData.filter().contains('description', SearchValue))));\n\n}\n\n","userEmail":"sijjo@ih.ng","creationTime":1529854178644},{"id":"28679ee2-cb21-560c-85ed-14f4909e1d89","title":"Progressive Web Apps (PWA)","content":"Hey everyone, so I made a post about Progressive web apps a year ago, and wanted to get an update from Wix or it's users to see what's up.\n\nI want to turn my site into a Progressive Web App for IOS. \nIt goes as follows:\n- User visits site, Mobile site view loads\n- User adds site to homepage\n- User now has the website in fullscreen view as an app.\n\nIs this possible to achieve? I know that there is an app in the market that allows to convert the site into a PWA, but its not quite there yet.\n\nI think having the ability to make a site into a PWA would be a great feature, I mean, you could literally make an app bruh...","userEmail":"im@ihi.vi","creationTime":1518867438529},{"id":"985edc12-a08f-541d-b670-9946bd4e9969","title":"Count dataset records after filtering it","content":"Hi,\nI am filtering my data with many parameters, after that i would like to show user how many records there are in this search. However, it seems the only way is to build same as filter query at get count from results. Is there any \"cleaner\" and easy way to get it?\n \nvar filter = wixData.filter();\n\nif ($w('#searchInput').value!=='') {\n    filter = filter.contains('nativeEventName', $w('#searchInput').value)\n    .or(filter.contains('tags', $w('#searchInput').value))\n    ;\n \n}\nif ($w('#dropEventType').value!=='') {\n    filter = filter.eq('eventType', $w('#dropEventType').value);\n}\nif ($w('#dropCategory').value!=='') {\n    filter = filter.eq('categoryName', $w('#dropCategory').value);\n}\nif ($w('#dropService').value!=='') {\n    filter = filter.eq('serviceName', $w('#dropService').value);\n}\nif ($w('#dropdownConnectors').value!=='') { \n    filter = filter.contains('serviceName', $w('#dropdownConnectors').value);\n\n}\n// finally, we set the filter\nconsole.log(filter);\n$w(\"#datasetEvents\").setFilter(filter);","userEmail":"ojew@agomeji.ms","creationTime":1533942776687},{"id":"ca1c48af-c1a4-5564-b2b1-b8eff267fa3d","title":"Is it down too there, or it just in specific region ?","content":"\n \n","userEmail":"ogaigomus@wasme.sl","creationTime":1532290869691},{"id":"0dec3984-e24f-5d36-8ba1-3564f99cfaf2","title":"Dropdown links","content":"Hi Team,\n\nOn my website www.thebackgalley.co.uk (main page) you can see 3 dropdown options Airline, Hotel and Destinations. I would like for customers to be able to select an airline etc from the dropdown list and it take them to the airlines website. Is this possible? i have nothing in my code as of yet. \n\nThanks ","userEmail":"im@lejcomi.li","creationTime":1518450145538},{"id":"75a31709-7cfe-5070-9685-0fb79cb85ee2","title":"Count number of record in a collection","content":"Please I need help counting the number of a record in a collection and displaying the number of time occurred, in a text fiel, here is my code, but not working\n \n wixData.query(\"#dataset1\")\n  .count()\n  .then( (num) => {\n let numberOfItems = num;\n  $w('#txtRegcourse').text = numberOfItems;\n  } )\n  .catch( (error) => {\n let errorMsg = error.message;\n let code = error.code;\n  } );","userEmail":"tuvopki@kedegil.pt","creationTime":1539467032564},{"id":"fd9845ca-3094-524e-967a-816f529f820b","title":"Problem with Multilingual","content":"Hello,\n3 problems with the Multilingual feature:\n1. In a form, when I change alignment from left to right in one language, it changes in the other language as well\n2. When moving an image in 1 version, it automatically moves it in the other one\n3. Same thing with the header - changing location of a link affects both versions\n\nHow do I disconnect these features from both language so they will be independent?","userEmail":"fal@gac.gg","creationTime":1517154367382},{"id":"ea52d05f-de7b-518f-a5bb-2bfcb6b232b8","title":"How to add Venmo to my checkout page?","content":"I have a delivery service website and need a Venmo option because students here use either cash or Venmo. No one uses cards or Paypal. Will this be possible? Do I have to implement code for this and if I do, how do I add Venmo by using code? Thank you. ","userEmail":"mov@viclubkom.ms","creationTime":1526938461031},{"id":"b5bde52f-df20-51b0-bbd7-fbfd7526af79","title":"Javascript Gmail API","content":" \nHi Everyone,\nI found great tutorials about how to send emails with GMAIL API from Javascript. \n\nTake a look:\nhttps://www.sitepoint.com/sending-emails-gmail-javascript-api/\n\nhttps://stackoverflow.com/questions/36946490/sending-email-from-my-javascript-app-via-gmail-api-mail-appears-in-gmail-sent\n\nBest,\n-Luigi\n","userEmail":"ju@ovoba.tt","creationTime":1539731043907},{"id":"ea58bb83-cd41-5465-bf4d-4bbc947e9eb0","title":"Color Picker?","content":"Need a standard color Picker (with n palettes) on a (Corvid) form (like 5 colums across, n down). Table Component cannot do cell colors, Repeater cannot do 5 (or whatever) colors per row, then continue on next row. So it looks like the html-component is the only option.\nAny of you forum geniuses have a better design idea?\n\nEDIT: on second thought, maybe it can be done with a repeater. Put 5 boxes on a row, all hidden;onload, get palette, do some calculations and fill n rows. Any other ideas?","userEmail":"ibozwi@je.bd","creationTime":1531020628256},{"id":"26f46d23-42ef-5a0c-ac5d-1922598da84d","title":"Parallax Feature on Mobile","content":"Hi There! I have a client who wants the mobile version of his site to Parallax... otherwise he wants to move his site to Word Press. I very much want to continue working with Wix... does anyone know code for this ? or even someone I can hire to be able to do this on the Wix platform? \n\nAlso, do we have any idea when WIX will be adding this to the mobile features? I really want to keep my client on WIX rather than having him switch to Word Press. Please help!","userEmail":"ik@no.gl","creationTime":1535788026006},{"id":"6c6ed54f-6487-5f71-96a4-2abcddae7b79","title":"Linked images to dataset works only in preview mode","content":"Hello I created a dataset and have permissions set to Read only ( also tried read+write) and have it set to site visitors can view but when I publish the site it doesnt work but in preview mode it works perfectly. I have also synced the dataset after making changes. can anyone please help it would be greatly appreciated. the url is kurdishloop.com","userEmail":"ge@jusza.ba","creationTime":1516804324615},{"id":"251e1969-93f1-5a8b-9561-18255f464bf2","title":"Question about record locking and one user overriding another’s data","content":"\nI have an application that allows end users to click in a table row to select it and assign or unassign themselves to two text fields. Everything works perfectly. However, If two people do this function at the same time, one overrides the other’s changes. Here’s the processing…\nThe table looks something like this:\n  \nUser 1           User 2        Date                Start       End\n \n<Available> Joe Blow       mm/dd/yyyyy hh:mm hh:mm...\n \n<Available> <Available>    mm/dd/yyyyy hh:mm hh:mm...,\n \n…\n[Save ]\n\nA user clicks on a row, say row 1 above to assign himself to the <available> cell in the first row. The code inserts the current user’s name in the User 1 column in row 1 and then writes the row back to the collection using this code:\n\nlet rowData = {\n_id: row_id,\ntitle: rowtitle,\nuser1: rowuser1,\nuser2: rowuser2, \n…\n};\n$w(\"#table1\").updateRow(workrow, rowData);\nwixData.save(\"Schedule\", rowData) // update the row in the underlying collection\n.then((results) => {\nlet item = results; //see item below \n$w(\"#text30\").text = message + \"on \" + rowdate \n})   // Error \n.catch((err) => {\nlet errorMsg = err;\n$w(\"#text30\").text = (\"update error: \" + errorMsg)\nconsole.log(\"save filed: \" + errorMsg)\n});\n\nIf a user selects a row, Presses “Save” his name replaces User 1. If at the same time, another user is looking at that same row and sees it is <available>, after selecting it, his name overwrites the other user’s name when he presses save.\n\nQuestion: Should Wix use the record’s underling update time to sense that user 1 changed the row before user 2 tries to change the same row, knowing that the update  has been changed prior to user 2 pressing “Save”, thus raising an error condition indicating that “another user has changed this same record” or something like that.\n\nOr do you have to code your own record locking strategy? Please advise. Obviously, having to code a concurrent update strategy to manage changes to the underlying database adds orders of complexity to the coding.  It would seem that the updateRow action should manage the timestamps and trigger an error if the row's timestamps changes between updates.  Thanks.","userEmail":"tij@zomowpi.sy","creationTime":1544034645035},{"id":"110eb114-b318-5252-98f7-85c3d7aa0232","title":"Google Cloud SQL","content":"Is it possible to use Cloud SQL as a database for a WIX website.  I've tried to translate the articles on using external databases with WIX, but have not been able to understand how that would work with Cloud SQL.  It would be nice if we could use the Cloud Proxy binary along with a key file to access our Cloud SQL.  But that's probably too much to hope for.  If this is possible, please provide detailed instructions.","userEmail":"fopuv@am.fk","creationTime":1539066550061},{"id":"75d6739e-5fbd-5d74-9ae3-72474da1670b","title":"Custom 404 on Dynamic Pages doesn't work","content":"I've used the following article in order to create a custom 404 page:\n\nhttps://support.wix.com/en/article/customizing-your-404-error-page\n\nAlthough the 404 works perfectly when on static pages, but when a dynamic page redirects to 404 it goes to the usual Wix default?\n\nNot sure if it's a bug or if I'm missing something.\n\nExample:\n\nRandom page on my site\n\nvs\n\nRandom page over dynamic path","userEmail":"puwlon@tajzagu.bi","creationTime":1537053095638},{"id":"4451fd03-8c24-57e5-8aef-8925fb663599","title":"Repeater Hover","content":"hey,\nI have some problem, i try to find solution on web or here in search but no results\nlook at the video and see the code.\nwhen i hover container in\nRepeater fast its stuck on hover mode.\n\n \n\n   $w('#dataset2').onReady(() => {\n        $w('#CatgContainer').onMouseIn((event) => {\n let $item = $w.at(event.context);\n            $item('#boxCategoryHover').show(\"float\", floatOptions);\n        })\n\n        $w('#CatgContainer').onMouseOut((event) => {\n let $item = $w.at(event.context);\n            $item('#boxCategoryHover').hide(\"float\", floatOptions);\n        })\n    })\n","userEmail":"afuud@em.nc","creationTime":1544409943384},{"id":"93687ba8-1db0-53d2-9d2a-7669863f446c","title":"How to create Waiting List in Registration","content":"Hello! According to this article I should be able to toggle On the \"Waiting List\" component in the Event Registration Email area. However, Waiting List does not appear. Any suggestions as to how to turn this feature On? \n\nThank you in advance.\n\n \n","userEmail":"furu@vi.st","creationTime":1531061849052},{"id":"51280f69-243a-5379-8364-5074c6accdd9","title":"editor whites out /hangs on loading particular (corrupt?) page","content":"A page on my site seems to have some issues.  When I select the page in the pages editor, I see the top of the page as expected.  however, if I move the cursor to click on the page or click on the menu editor for the dropdown selections of rename/delete/etc ... the screen whites out and effectively hangs.\n\nI don't know if the page has been corrupted somehow or is grabbing infinite resources, but I need to delete it.  However, all the methods to select the page cause this behavior.  \n\nAll other pages act as expected.  Support has not been of help at this point. \n\nI would just like to delete it.\n\nAny ideas?  ","userEmail":"ba@hecsi.pw","creationTime":1524993039301},{"id":"2c2f5033-5801-5045-b8da-aed81f2bd790","title":"'loginEmail' value to pass to 2nd DB","content":"I have a members area on my site which people can create an account via the standard username/password which gets saved in the Wix CRM (PrivateMembersData collection). After they click submit to create the account, it automatically takes them to another page which has form fields connected to my 2nd database which are used to create their dynamic profile page. The 2nd database has a reference field which points back to the 'loginEmail' column of the PrivateMembersData collection. \n\nThe problem I'm having is that when the member fills out the form (2nd database), all their data gets saved correctly, but the reference field ('loginEmail') is left blank. Unless I manually go in and set it via the Wix Live Database manager. [SCREENSHOT BELOW]\n\nHow can I have the users' loginEmails get automatically passed to the 2nd database so that I don't have to do this manually?\n\nBecause if a user logs out and logs back in, they're unable to see their data as the connection from PrivateMembersData and the 2nd database is broken, when this field is blank for their row.\n\nThanks in advance!\n\n \n","userEmail":"wu@bomisva.bm","creationTime":1539011605825},{"id":"662464e6-2fb9-5289-8df2-09b8cc842f8b","title":"Wix Users (and more?) is down","content":"Is anyone else experiencing this? Login and signup aren't working in my sites, and I am logging server errors. Wix Support (what a misnomer!) is absolutely a waste of time.\nHow often does this happen?","userEmail":"le@co.jo","creationTime":1539262437742},{"id":"97407667-90bd-535e-b472-9f286ca3e32a","title":"pagination with code for search results","content":"\nhi i need help with adding pagination to my search results page with some code, right now i have everything working fine i just need an example code to add some pagination to search results. i have added the pagination before but when you would click the next page it would reset the search results in the repeater.","userEmail":"genna@nek.dz","creationTime":1540623209495},{"id":"85ba6523-3af4-586e-858e-c52233a6485a","title":"Collapsible Logo","content":"I'm trying to recreate this feature: https://www.gulfstream.com/, where the logo (Gulfstream) changes into the icon as you scroll down. I have the icon in a white box that covers the main logo, which is \"collapsed on load\". What code do I need to add to get this to work? Site link here: https://pauledesign.wixsite.com/airspace","userEmail":"cera@azze.ye","creationTime":1540354738287},{"id":"5ca372ed-6216-5314-9b6d-9eabaf6fce67","title":"Charge customers if they are choosing Manual Payments","content":"In India, most of the shipping companies charge the seller additional fees if the customer is paying them cash at the time of delivery. I need to charge customers a fee if they choose Manual Payments such as Cash On Delivery. Currently, wix doesn't have a feature where I can charge customers only in the case of Manual Payments. \n\nIs there a code or any other way to charge customers opting for Manual Payments OR charge everyone a handling fee irrespective of their mode of payments but provide a discount coupon to only those who are doing an online payment OR Cashback for customers using online payments?\n\nAny help will be appreciated.","userEmail":"zo@minmoho.eh","creationTime":1533189699751},{"id":"5f025e96-82a4-5b88-aaf3-28f100881f29","title":"Decreased mobile load time by 15+seconds with preload key request but still have small error","content":"TLDR - Is there ANY other way to do a preload key request with wix. PLEASE! It shaves off so much time it's insane.\n\nSo running the google pagespeed test, it tells me to use preload key requests to speed up the website.  \"Preload key requests 14.04 s Consider using <link rel=preload> to prioritize fetching resources that are currently requested later in page load.\"\n\nIt literally would increase page load time by 14 seconds, which is ridiculous. \n\nI was able to pop this code line into the 'tracking and analytics' because that's the easiest way to get an html code on all pages. <link rel='preload' href=\"https://www.hydrochemsystems.com/_partials/wix-bolt/1.2670.0/node_modules/santa-wix-code/dist/bolt-worker.js>\n\nIt works on every page except the home page. The number within the code \"1.2670.0\" does seem to change, and I wonder if there's a preload request that's more basic that wouldn't change. It also shows code at the top of the pages when switch between them or on a refresh, causing the menu bar to disappear. \n\nI've tried \"<link rel='preload' href=\"https://www.hydrochemsystems.com/_partials/wix-bolt/1.2687.0/node_modules/santa-wix-code/dist/bolt-worker.js\" as=\"script\">\" but google says \n\n Warnings: A preload <link> was found for \"https://www.hydrochemsystems.com/_partials/wix-bolt/1.2687.0/node_modules/santa-wix-code/dist/bolt-worker.js\" but was not used by the browser. Check that you are using the `crossorigin` attribute properly. \n\nI've tried the crossorigin as crossorigin, crossorigin=\"anonymous\" crossorigin=\"\" and crossorigin=\"use-credentials\".\n\nI don't know what else to do but this is a massive game changer if I can just get it to work and not mess up the refresh.\n \n \n\n\n","userEmail":"icaska@ajpupmot.bv","creationTime":1540678844782},{"id":"25ce5afe-ed09-51e5-be35-92e49db4ece2","title":"My E-commerce website on Wix is loading slowly","content":"Hi All,\n\nCurrently, my website takes time to load especially on mobile. The site elements starts showing one by one which doesn't look professional at all. I did hear similar reviews from other Wix users. Is there any way I can make my website to load at a faster rate? If not, atleast load all my site elements show up at the same time.\n","userEmail":"mohwaffa@jo.bg","creationTime":1521836624201},{"id":"dbfa8b10-2a0b-59da-ba93-99f948389d44","title":"Help with If/Else Statement","content":"Hello,\n\nThis seems very basic, but for some reason I can't get it to work.   I want the Onclick for button 60 to be called only if the if statement is valid (input10 has text).\n\n\n\n \n\n\n\nI have tried many ways, and I simply can't get it to work.  However, the onclick event happens without the if statement.\n\n  ($w('#input10').value.length >= 8) \n  ($w('#input10').value !== \"\") \n  ($w('#input10').value === true) \n\n\nhere is the code block that doesn't seem to work :\n\n\n\n \nif \n        ($w('#input10').value.length >= 8) \n{\n  $w('#button60').onClick((event) => {\n\n let user = wixUsers.currentUser;\n let isLoggedIn = user.loggedIn;\n if (!isLoggedIn) {\n      wixUsers.promptLogin().then(() => {\n       processPlan(planId, planPrice);\n     })\n  } else {\n      processPlan(planId, planPrice);\n    }\n }\n );\n\n}\n\n\n\n\nThe code for the entire page:\n\n\n\n \nimport wixLocation from 'wix-location';\nimport wixWindow from 'wix-window';\nimport wixPay from 'wix-pay';\nimport wixPaidPlans from 'wix-paid-plans';\nimport wixUsers from 'wix-users';\n\n\n$w.onReady(function () {\n\n const currentPlanObject = $w(\"#dynamicDataset\").getCurrentItem();\n const planId = currentPlanObject._id;\n const planPrice = currentPlanObject.price;\n\n\nif \n        ($w('#input10').value.length >= 8) \n{\n  $w('#button60').onClick((event) => {\n\n let user = wixUsers.currentUser;\n let isLoggedIn = user.loggedIn;\n if (!isLoggedIn) {\n      wixUsers.promptLogin().then(() => {\n       processPlan(planId, planPrice);\n     })\n  } else {\n      processPlan(planId, planPrice);\n    }\n }\n );\n\n}\n \n\n});\n\nfunction processPlan(myId) {\n\n \n    wixPaidPlans.purchasePlan(myId).then(orderObject => {\n      wixWindow.openLightbox(\"Contact1\", orderObject)\n       .then((goForIt) => {\n if (goForIt) {\n         wixPay.startPayment(orderObject.wixPayOrderId);\n       }\n      });\n    })\n \n}\n\n\n\n\nPlease help!  I hope it's just some small mistake I made.\n\nThanks in advance!\n","userEmail":"guecipe@mot.va","creationTime":1527893000051},{"id":"868ea672-2917-5524-9e51-d30610f1f893","title":"Create multi-page form connected to database","content":"I currently have a very long application from divided roughly in half between two different pages connected to the same database. The first \"Save & Continue\" button links to the second page, but logs the inputted information as a separate entry. The second page is then submitted with its own entry. \n\nI need these to submit as a single entry, ideally from the same page, transitioning between steps of the form rather than pages of the site. \n\nI tried to rebuild the form using this template:\nhttps://www.wix.com/code/home/example/Multistage-Form\n\n...but had no luck. The form was non-functioning. This also seems like a cumbersome way to code the form, disconnecting all of its elements from the database, that is. \n\nI can see that the submit button has the option to connect the \"next page\" in the dataset, which leads me to believe I can simply divide the fields within the database, but I don't see this option. \n\nHas anyone else encountered this issue or created any solutions? Any help is greatly appreciated.","userEmail":"cennadoh@itobik.ve","creationTime":1519017491938},{"id":"0b9372a7-1127-5591-9c39-60d114606a02","title":"Wix + External Fonts?","content":"Hi!\n\nAnyone know if it's possible to embed external fonts into a Wix site? I'm not very competent at coding so any messing about with CSS files, aside from the basics, might be tricky.\n\nI can't seem to see anything concrete online about it. Or even a place to start weirdly enough.\n\nCheers,\nStu.\n\nAnd just to add, the typeface I'm looking to use online is DIN Next from Fonts.com https://www.fonts.com/font/monotype/din-next","userEmail":"rosewcun@li.sj","creationTime":1530444677996},{"id":"4fa19313-8515-56fa-8a2e-a49266239534","title":"Adding two databases","content":"This may be a silly question...\n\nI am attempting to have two tables, side by side, using two different database sets.  However, the second DB isn't popping up when I attempt to connect the DB to the table.  Do you know a reason this may be happening? Thanks.  ","userEmail":"av@norowlun.ma","creationTime":1544522278951},{"id":"6bb3d7d3-c98e-5625-9b34-72a75febf0f4","title":"Creating multiple show-more/show-less links","content":"Hi!\n\nI'am trying to figure out how to add multiple show-more links. I'am not super into code so don't blame me, I tried hahah. This is the code I got so far but issn't working.\n\nlet fullText; // variable to hold the full text\nlet shortText; // variable to hold the short version of the text\n\n$w.onReady(function () {\n // how many characters to include in the shortened version\n const shortTextLength = 1000;\n // read the full text and store it in the fullText variable\n    fullText = $w(\"#text6\").text;\n // grab the number of characters defined in shortTextLength and store them in the shortText variable\n    shortText = fullText.substr(0, shortTextLength) + \"...\";\n // set the contents of the text element to be the short text\n    $w(\"#text6\").text = shortText;\n\n});\n\nexport function button2_click(event) {\n // check the contents of the text element \nif ($w(\"#text6\").text === shortText) {\n // if currently displaying short text, display the full text\n    $w(\"#text6\").text = fullText;\n    $w(\"#button2\").label = \"Minder\";    \n} else {\n // if currently displaying full text, display the short text\n    $w(\"#text6\").text = shortText;\n    $w(\"#button2\").label = \"Lees meer...\";\n}\n}\n\n\n$w.onReady(function () {\n // how many characters to include in the shortened version\n const shortTextLength = 1000;\n // read the full text and store it in the fullText variable\n    fullText = $w(\"#text1\").text;\n // grab the number of characters defined in shortTextLength and store them in the shortText variable\n    shortText = fullText.substr(0, shortTextLength) + \"...\";\n // set the contents of the text element to be the short text\n    $w(\"#text1\").text = shortText;\n\n});\n\nexport function button1_click(event) {\n // check the contents of the text element \n if ($w(\"#text1\").text === shortText) {\n // if currently displaying short text, display the full text\n        $w(\"#text1\").text = fullText;\n        $w(\"#button1\").label = \"Minder\";\n    } else {\n // if currently displaying full text, display the short text\n        $w(\"#text1\").text = shortText;\n        $w(\"#button1\").label = \"Lees meer...\";\n    }\n}\n\n\nI found this link: https://support.wix.com/en/article/wix-code-tutorial-creating-a-show-more-link\nwhich works perfectly with one text and one button but when I copy the code to make another show-more link (for #text6 and #button2) the text box (#text6) shows the content of text1 after clicking the \"Lees meer...\" button (#button2).\n\n","userEmail":"cuale@dow.cx","creationTime":1521885644940},{"id":"63671683-c695-5fda-b81e-f099ac845d3b","title":"Bypass on Multi-step forms with arrow key","content":"One of the examples provided for doing multistep forms was to use a slideshow and on each slide add a block of content. However, when a user press left or right key can jump between slides and there's no way to disable that?\n\nSo basically if a user is typing and hit the left arrow key it'll go to the prev slide. Instead of move in the text field...","userEmail":"mako@bojac.gm","creationTime":1536720147802},{"id":"79fac764-81d3-5dc3-bf11-e1df22a7f308","title":"How do i create a list from certain items on a list ","content":"I want to be able to click on bathroom fixtures and collapsible list appears with  toilet roll holders, towel rings, soap dishes, shelves, hooks, mirrors & cabinets etc (with a little dropdown arrow) \n \n","userEmail":"zu@rav.gm","creationTime":1515514588872},{"id":"1d23fcbf-5105-5d72-988a-63c9f4ade6b2","title":"TypeError: cellData.indexOf is not a function","content":"I have a table in a dynamic page connected to a dataset, the first column of the table retrieves images (uploaded to database from media > site files).\n\nI'm trying to link the images in the table to Lightbox, i.e. when a cell populated with an image is clicked the image will popup.\n\nMy Code: \n\ncode inserted in Lightbox:\nimport wixWindow from 'wix-window';\n\n$w.onReady(function () {\n \n const recievedImage = wixWindow.lightbox1.getContext();  \n    $w('#image1').src = recievedImage;\n});\ncode inserted in dynamic page:\nimport wixWindow from 'wix-window';\n\nexport function table1_cellSelect(event, $w) {\n let cellData = event.cellData; \n \n //the cell contains an image\n if (cellData.indexOf(\"image://\") !== -1){\n            wixWindow.openLightbox(\"lightbox1\", cellData);  \n        }\n}\ntable1 properties:\nSelect by cells\nOnCellSelect - table1_cellSelect\n\nError:\n TypeError: cellData.indexOf is not a function\n\nCan anyone please help me and correct my code??\n\nthanx,\nNoa\n\n","userEmail":"hehaki@la.cn","creationTime":1516192253218},{"id":"f20ba4a8-901f-5d03-860e-561b94b06bd2","title":"Trend problem when using multilingual in the Wix platform","content":"Hello, when using multilingual on the Wix platform, and when you make the modification to the English version gets a direct change to the Arabic version, for example when modifying the direction of the basic menu elements in the English version to become left to right, the direction of the elements in the Arabic version also becomes Left to right! How do I solve this problem?","userEmail":"mif@jo.tc","creationTime":1524362604686},{"id":"78d09b01-6ca0-5746-82a4-9e02db81552a","title":"Call a Fullstory function when form submits","content":"Hi\n\n\nI want to call a Fullstory function (FS.setUserVars) when I submit a form on my Wix page, using data from the form fields. I couldn't find a way to do it using corvid, and the Fullstory app integration is just for the basic tracking code, not for custom user variable recording.\n\n\nThanks!","userEmail":"bed@voroz.cu","creationTime":1515742554251},{"id":"e1f03a9f-bc11-59ff-9875-5661c85b52f0","title":"Making an auction site (SOLVED)","content":"Edit: I've now made a full working auction site in WIX. If you need help or want me to make one for you, send a mail to hello@laaven.xyz.\n\nHi! I've been trying to make an auction site for cars, but can't seem to get it quite right..\n\nHas anyone made a working auction site in Wix? Or if you know how to do it, please get in touch with me! Would love to get some guidance/help :)\n\nIn forhand, thanks! ","userEmail":"tasigum@uni.ng","creationTime":1524049963867},{"id":"3754465d-af99-5526-867c-741285876241","title":"Sync Booking Database with 3rd Party Database","content":"I have two booking systems, Wix and back-office applications. I need to sync them periodically. My questions are:\n\n1. where Wix keeps out the box booking database with appointments, as I see Schedule, Services and Staff db's only? I need to read these appointments and send them to 3rd party API for processing.\n\n2. How do I create new appointments programmatically by inserting new records into Wix appointment db, which is actually not presented in the Wix database structure?\n\n3. Can I create custom database for my Wix appointments and make Wix out the box booking application to work with this custom database?\n\n\n \n","userEmail":"tifgibfaz@haval.nr","creationTime":1541831651547},{"id":"70dd9986-f3af-576b-8dd7-4969950a0319","title":"Follow Users","content":"I would like to implement a system that would allow the users of my site to follow/Support each other something similar to the Twitter follow system. Has anyone done this in their own sites and if so how did you manage it ?","userEmail":"ticagaf@jezpordo.vn","creationTime":1532692778162},{"id":"8050ca4f-6a6c-5f50-a0ed-11887d658f2f","title":"how to filter a table according to the current user","content":"I would like to show only a few document releases according to the user you are accessing.\nFor example: Each user must have private access to a database documents through a table.\nHow do I collect current user information (email for example) and use it as an intruction for filtering?\n\n\n \n","userEmail":"aci@sulbamsun.mr","creationTime":1515422235407},{"id":"b6a3914c-eacb-5d05-b844-2e49ea4f3dd8","title":"Get value from one page and send it to another page","content":"\n \nI want the value that is kept in a variable to be available at any other page. Is there anyway to do this?\n","userEmail":"za@soaju.kw","creationTime":1516079748386},{"id":"8c3ff20b-ecfe-5934-a038-282de5207c68","title":"The text editor is NOT working.","content":"\n \n","userEmail":"mire@nozukok.at","creationTime":1545894142917},{"id":"23563a6a-a9fd-5c37-a726-187f546df536","title":"Freeze repeater / user input / image","content":"Hi,\n\nHow can i freeze repeater / user input / image?\n","userEmail":"numiho@tomguwke.id","creationTime":1545578497935},{"id":"8f503a35-6156-5afc-ba66-3a983aa5cdea","title":"Linking search results in a table to a dynamic page","content":"Hello all,\n\nI'm building a website that allows users to search for a company based on the name and returns the results in a table. I would then like to link the search results to a dynamic page that provides more details of the company.\n\nI've added the database of companies and built the search function and table based on the following code:\n\n\n \n\nThis gives the following results on the site when searching for \"Smith\":\n\n\n \nI'm now trying to link this results table to a dynamic page so that when a row is selected and clicked the user will be taken to a page containing more detailed information about the company.\n\nI've found the following code in the Forum which I think will achieve this:\n\n\n \n\nUnfortunately I'm a world-class beginner at website coding and I have no idea what code to enter for this line as I don't know the syntax for my dynamic page:\n\n wixLocation.to(`${myRow[link-myDynamicPage-_id]}`); \n\nIs the code above the correct code to use for what I am trying to achieve (ie linking my search results to a dynamic page)?\n\nI'd also like the information that appears on the dynamic page to appear as a table with the headings along the left-hand side. I can only find tables that have headings across the top and as there are 20 fields of data this is impractical for displaying the information. My current dynamic page just had text fields for the results but this is quite cumbersome:\n\n\n\n\n \n\n\nSorry this turned into such a long post! I'd be really grateful for some assistance as I'm a little lost with this problem.\n\nThanks so much in advance,\nHuw\n\n\n","userEmail":"pees@acgiew.mk","creationTime":1520744679957},{"id":"153d3e96-50c6-5460-a6f3-ac9926092f11","title":"Is there any ways to calculate in database cells?","content":"I want to show my website's members information in dynamic pages automatically from a database, like photo / name / birth / age / etc.\n\nBut I can not find the way to show the age... because age has to be changed day by day.\n\nso if it's possible to use a formula like excel (DATEDIF(\"2003/4/7\",\"2014/2/12\",\"Y\")) in wix code, it's very nice, but it seems to be impossible.\n\nDoes someone know how to do this or some other way to show age automatically?\nPlease help.","userEmail":"bav@ozconhob.gf","creationTime":1527632632514},{"id":"45325244-b534-5d32-b740-4ef2b9083dac","title":"How could I set a PDF preview, on dynamic pages, to show a PDF file uploaded and added to the database ?","content":"Hi,\n\n\nI'm using a database and dynamic pages to list a selection of documents.\nMy database contain the followings :\n* Intern file reference\n* Date\n* Type of document\n* Title\n* Description\n* === Uploaded PDF file, usually 1 or 2 pages ===\n\nMy dynamic pages are showing\n* Date\n* Type of document\n* Title\n* Description\nAnd I would like to add a window showing the actual PDF on every dynamic page. I've used the \"PDF Viewer\" app but I don't see any way to make it work with the dynamic database, meaning that it can only show up the same file on every page ...\nThose PDF are short official documents and I can't just copy/paste the text in a Text frame, I need to keep the exact PDF with it's exact presentation.\n\n\nSo, is there anyway I could set up a PDF preview to show the specific PDF document corresponding to each dynamic page, using the PDF document listed in my database sheet ?\n\nIf not, why is there even an option to put a document in the database ? Only to use a button link ?\n\n\nIn advance, thanks a lot for your help.","userEmail":"na@tuggo.mc","creationTime":1544707515562},{"id":"52d6be88-44e8-50b6-b26b-db92671ec493","title":"Viewing infos of the member from custom Dataset","content":"I used this code to retrieve the information of a member from a custom dataset but instead it is returning the same data in all member account. My intent is to return only the member data log in.\nNeed help please\nimport wixUsers from 'wix-users';\nimport wixdata from 'wix-data'\n$w.onReady(function () {\n  wixUsers.onLogin((user) => {\n let userId = user.id; // \"r5cme-6fem-485j-djre-4844c49\"\n let isLoggedIn = user.loggedIn; // true\n if (wixUsers.currentUser.loggedIn) {\n      user.getEmail()\n        .then((email) => {\n let userEmail = email; // \"user@something.com\"\n          $w(\"#MemberPlanDataset\").onReady(() =>\n            user.getMemberPlanDataset()\n            .then((MemberPlanDataset) => {\n let UserPlan = MemberPlanDataset;\n let Myemail = UserPlan.email;\n if ((userEmail) === UserPlan.email) {\n let MyPlan = UserPlan.Plan;\n let MyPrix = UserPlan.Prix;\n let MyStatut = UserPlan.Statut;\n let MyValidite = UserPlan.validite;\n              } else {\n                $w(\"#box18\").show();\n\n              }\n\n            }));\n        });\n    }\n  });\n});","userEmail":"bi@ridlehle.cr","creationTime":1517745897676},{"id":"14277d54-3cb3-5c9f-ad63-9fa57ee41bc3","title":"Responsive Site Layout","content":" \nHi,\n\nI just enabled developer tools for Wix Code and am exploring its capabilities. With Wix Code is there a way that I can make the site layout responsive? I want to get a more full width look. The grid lines have always been restricting so if anyone has tried this out, let me know!\n\nThank you.","userEmail":"fop@wadli.hn","creationTime":1520214696659},{"id":"87f1a0e9-c30d-5245-aada-603bd3984597","title":"ADD A CONTACT ME BUTTON FOR MEMBERS","content":" \nI am trying to add a CONTACT ME button to members to enable other members to either call or send them a direct email, without going through database or admins.\nFree Members will need to be able to add their own phone number &/or email address to a button or other function for paid members to contact them DIRECT, preferably in the menu below the PROFILE or part of the profile page.\nI am happy to pay a pro to do this is needed but nobody seems to be able to tell me a cost to do so, or how I can do it myself.\n \n\nCan somone please explain how I can do this?","userEmail":"al@vina.kh","creationTime":1518366630493},{"id":"23f6c0a6-f380-5e78-bd98-a75361aae042","title":"How to Show location on Google Maps?","content":"Hi,\n\nI have the following components on a Dynamic Page:\n\nTable (ID = table1, populated by dynamicDataset, title contains names of places)\nGoogle Map (ID = googlemap1, should show the location of the Current Item title) \n\nIm trying to show the location of the current item title (.getCurrentItem().title) on the map when  its displayed in the viewable part of the current window (onViewportEnter).\n\nUsing this example as a stating point: How to Use Google Maps Services in Wix Code \nAnd this Places API Guide\n\n\nI have google API and enabled the Places API.\n\nI created a web module (backend) file named gapi.jsw\nIn that file, web modules which will be used to call the Google Maps online service functions.\nimport {fetch} from 'wix-fetch';\nconst key = \"Crazy-long_Google_API-key\"; // My own API key is here\n\n// Retrieve details of the selected location\nconst dpart1 = \"https://maps.googleapis.com/maps/api/place/details/json?\";\nconst dpart2 = \"&key=\";\n// this function is triggered when clicking on a suggestion list repeater item\nexport function details(id) {\n    let placeid = \"placeid=\" + id;\n    let url = dpart1 + placeid + dpart2 + key;\n    return fetch (url, {method: 'get'}).then( (httpResponse) => { \n        if (httpResponse.ok) {      \n            return httpResponse.json(); \n        }\n    });\n}\n\n\n    3. In the Map page i added the following code, \nimport wixWindow from 'wix-window';\nimport {local} from 'wix-storage';\nimport {details} from 'backend/gapi';\n\n//this function is triggered when the map is displayed in the viewable part of the current window (onViewportEnter)\nexport function location_title() {\n    let place_id = $w('#dynamicDataset').getCurrentItem().title;\n    set_details(place_id);\n}\n\n     4. The set_details( ) function need to be adjusted to my needs. Since am using Place and not address (as in the example) i assume the Fields need to be changed from address_components (as country or city) to geometry/location. Furthermore, the example using a text input and repeater which i don't.  Here is the original code from the link above with :\n\n/* This function calls the details() web module to retrieve the details (city, country, utc, etc) of the selected or saved location. */\n\nfunction set_details(val) {\n    details(val).then(function(resp) {\n    \t// find the city (locality) and country of the location\n        let place = resp.result;\n        var filtered_array = place.address_components.filter(function(address_component){\n            return address_component.types.includes(\"country\");\n        }); \n        var country = filtered_array.length ? filtered_array[0].long_name: \"\";\n        filtered_array = place.address_components.filter(function(address_component){\n            return address_component.types.includes(\"locality\");\n        }); \n        var locality = filtered_array.length ? filtered_array[0].long_name: \"\";\n console.log(\"details: \" + locality);\n \n        let name = place.formatted_address;\n        let id = place.place_id;\n        let utc = place.utc_offset;\n        let lat = place.geometry.location.lat;\n        let lng = place.geometry.location.lng; \n\n        // save the details of the location with wix-storage\n        local.setItem(\"place_city\", name);\n        local.setItem(\"place_lat\", lat);\n        local.setItem(\"place_lng\", lng);\n        local.setItem(\"place_utc\", utc);\n        local.setItem(\"place_id\", id);\n        $w(\"#input1\").value = name; // set input field to location\n   \n        // array of location detail items for the repeater\n        let detailsList = \n        [\n            {\n                \"_id\": \"1\",\n                \"text3\": \"place name\",\n                \"text4\": name\n            },\n            {\n                \"_id\": \"2\",\n                \"text3\": \"latitude\",\n                \"text4\": \"\" + lat\n            },\n            {\n                \"_id\": \"3\",\n                \"text3\": \"longitude\",\n                \"text4\": \"\" + lng\n            },\n            {\n                \"_id\": \"4\",\n                \"text3\": \"utc\",\n                \"text4\": \"\" + utc\n            },\n            {\n                \"_id\": \"5\",\n                \"text3\": \"place id\",\n                \"text4\": id\n            }   \n        ];   \n\n        // set the details repeater data and show it\n        $w(\"#repeater2\").data = detailsList; // add data to our repeater\n        $w(\"#repeater2\").show();\n    }); \n}\n\nWill appreciate your help in adjusting the code for my needs.\n\nTHANX  : )\n","userEmail":"luva@dod.aq","creationTime":1541487833522},{"id":"0b74ddd5-ac9b-526d-a157-37b292930f36","title":"Problem with the integration of iFrame ","content":"I have tried to intregrate the following link by seeting an iFrame on our website:\n\n <script type=\"text/javascript\" src=\"https://myconvento.com/assets/system/js/external/iframeResizer.min.js\"></script>\n<script type=\"text/javascript\" charset=\"utf-8\" data-id=\"4239\" data-c=\"0\" id=\"newsroom_embedded_js\">\n    (function () {\n        var script = document.createElement(\"script\");\n        script.type = \"text/javascript\";\n        script.async = true;\n        script.src = \"https://myconvento.com/assets/system/js/external/newsroom_embedded.js.php\";\n        var i = document.getElementsByTagName(\"head\")[0];\n        i.parentNode.insertBefore(script, i);\n    })();\n</script>\n\nUnfortunately there only appears a white screen. Is there a problem with the link? We got the link from a company whose webbased software we are using for publishing our press relations.\n\nMaybe somebody knows what is going wrong.\n\nThanks in advance.","userEmail":"cirbes@le.in","creationTime":1516208233633},{"id":"846d0462-b5e2-5f88-9f6f-131cf73e065d","title":"Lightboxes are so slow","content":"I know it's already been discussed here so many times, but it's just can't be acceptable.\nOpening lightboxes on mobile is just too slow.\nIt's doesn't make sense that you have to wait more than a second for it to pop up (on some of the most advanced cellphones).\nOn iPhones, it's relatively OK (far from being perfect though). but on Android it's just doesn't fit to the current decade standards.\nTo make it clear -  I'm talking about triggered lightboxes (so the delay settings on the editor is irrelevant). + It's much more noticeable, if you pass some data (even a small object) to it.\n\nWhenever it's possible, I use collapsed-expanded boxes instead, but when it's not, I'm helpless.\n\nAny idea/workaround/advice will be welcomed.\nThanks,\nJ.D.\n ","userEmail":"vo@ujokurod.ag","creationTime":1539441037407},{"id":"cf635c66-99e5-5886-8c98-adee89f93772","title":"Fade out text box","content":"Hi there,\nI know that Wix has a great Fade in function for text, but I would like the text to fade in, then fade out, or if easier, just fade out after about 5 seconds. Can anyone help?\nThanks\n","userEmail":"ogoroc@ij.si","creationTime":1517862760904},{"id":"efcc0296-85bc-5d14-a98d-93ebdc58fd1e","title":"need help with pagination on search results page ","content":"hi i need help with adding pagination to my search results page with some code, right now i have everything working fine i just need an example code to add some pagination to search results. here is the search function code i am using:  \n\n\nfunction search() {\n\n    wixData.query('AgentsBuyer')\n\n        .contains('location1', $w(\"#searchBar\").value)\n        .or(wixData.query('AgentsBuyer').contains('zipCodes', $w(\"#searchBar\").value))\n        .or(wixData.query('AgentsBuyer').contains('name', $w(\"#searchBar\").value))\n        .or(wixData.query('AgentsBuyer').contains('location2', $w(\"#searchBar\").value))\n        .or(wixData.query('AgentsBuyer').contains('location3', $w(\"#searchBar\").value))\n        .limit(200)\n        .find()\n\n        .then(results1 => {\n\n            $w('#repeater1').data = results1.items;\n if (results1.length > 0){\n                $w('#noResText').hide();\n            } else {\n                $w('#noResText').show();\n            }\n \n\n        })\n        .catch((err) => {\n let errorMsg = err;\n        });\n\n}\n\n\n\nthanks for all the help in advance !!!!","userEmail":"wofisku@panoho.mv","creationTime":1530383910714},{"id":"b0e07f5b-424b-582f-adca-ed005019d656","title":"Check the validity of all input in one go","content":"I have created a form with text inputs, dropdowns and checkboxes. Some of them are required and some aren't. Since there are too many input fields, I want to select all input in one go, check if all of the inputs are valid. Is there any functions that I can use? I tried grouping the elements together and used forEachItem, and apparently it doesn't work.","userEmail":"fufeju@zus.iq","creationTime":1521106160659},{"id":"71879c7f-8ea4-545a-873e-0cfb7a345911","title":"Improve responsiveness on payment page","content":" Hi team,\n\nAnother post to try and improve my coding skills and make some of the site more responsive. I have a ton of code to check the validity on my paymnet page, it seems at times to slow down user input when typing (all the usual stuff has been done with cookies, the latest version of Chrome etc)\n\nI think maybe if I improve the code it may help? I have spoken to the Wix team and they are looking into this at their end also.\n\nAnyway, below I have some code for 2 participants, which with more people the code size increases... I have 8 spaces, so you can imagine how much code there is... \n\nI have played with functions within function to reduce but it behaves oddly.. this code is the only way, so far that it works as expected.\n\n\nThank you!\nlet validationMessage = \"\"\n\nfunction participant1(){\n if (!$w('#medicalsOne').value) validationMessage += 'Participant 1 - If no medicals, please enter None\\n';\n if (!$w('#ECNameOne').value) validationMessage += 'Participant 1 - Please enter emergency contact name\\n';\n if (!$w('#ECNumbOne').value) validationMessage += 'Participant 1 - Please enter emergency contact number\\n';\n if (!$w('#datePicker1').value) validationMessage += 'Participant 1 - Please enter DOB\\n';\n if (!$w('#groupExperience').value) validationMessage += 'Please provide a brief overview of your/groups expereince\\n';\n if (!$w('#courseAims').value) validationMessage += 'Please provide a brief aim of your trip/course\\n';\n    $w('#validationMessageDetails').text = validationMessage;\n    $w('#validationMessageDetails').expand();\n}\n\nfunction participant2(){\n if (!$w('#medicalsOne').value) validationMessage += 'Participant 1 - If no medicals, please enter None\\n';\n if (!$w('#ECNameOne').value) validationMessage += 'Participant 1 - Please enter emergency contact name\\n';\n if (!$w('#ECNumbOne').value) validationMessage += 'Participant 1 - Please enter emergency contact number\\n';\n if (!$w('#datePicker1').value) validationMessage += 'Participant 1 - Please enter DOB\\n';\n if (!$w('#nameTwo').value) validationMessage += 'Participant 2 - Please enter a name\\n';\n if (!$w('#contactNumbTwo').value) validationMessage += 'Participant 2 - Please enter contact number\\n';\n if (!$w('#medicalsTwo').value) validationMessage += 'Participant 2 - If no medicals, please enter None\\n';\n if (!$w('#ECNameTwo').value) validationMessage += 'Participant 2 - Please enter emergency contact name\\n';\n if (!$w('#ECNumbTwo').value) validationMessage += 'Participant 2 - Please enter emergency contact number\\n';\n if (!$w('#datePicker2').value) validationMessage += 'Participant 2 - Please enter DOB\\n';\n if (!$w('#groupExperience').value) validationMessage += 'Please provide a brief overview of your/groups expereince\\n';\n if (!$w('#courseAims').value) validationMessage += 'Please provide a brief aim of your trip/course\\n';\n    $w('#validationMessageDetails').text = validationMessage;\n    $w('#validationMessageDetails').expand();\n}\n \n\nif ($w('#participants').value === '1') {\n    participant1()\n if ($w(\"#medicalsOne\").value && $w('#ECNameOne').value && $w('#datePicker1').value && $w('#ECNumbOne').value\n    && $w('#groupExperience').value && $w('#courseAims').value) showOrder();\n    }\n    \n    \n if ($w('#participants').value === '2'){\n    participant2()\n if ($w(\"#medicalsOne\").value && $w('#ECNameOne').value && $w('#datePicker1').value && $w('#ECNumbOne').value \n    && $w(\"#nameTwo\").value && $w('#contactNumbTwo').value && $w('#medicalsTwo').value && $w('#ECNameTwo').value && $w('#ECNumbTwo').value && $w('#datePicker2').value\n    && $w('#groupExperience').value && $w('#courseAims').value) showOrder();\n    }\n","userEmail":"ajim@rogden.mm","creationTime":1522689712251},{"id":"5b9b4972-3876-5b9b-83cd-18ea0c992d54","title":"Copy text from a table","content":"Hi,\nI am using tables (from the Lists & Grids) that displays content from my databases, and i see that i cannot mark the text inside the table cells (live site) in order to copy paste it to another location.\n\nCan you please advise?\n\nThanks,\nRoy","userEmail":"jikhez@zepu.mq","creationTime":1519544034671},{"id":"51d21090-fe52-5d26-9485-3b41095a277b","title":"How to trigger a Video Download? Wix Video Player","content":"Dear Community,\ni would love to know how to trigger a video Download on Button Click.\nI have a database with videos inside connected to the wix video Player. \nI want to add a button wich trigges a video Download onClick. I know how it works with images but i can´t achieve this with videos.\n\nI know that wix Video supports \"Right Click -> Download Video\" but i need the button solution.\n\nIs there anything I´m missing? \n\nI Apriciate your help guys.","userEmail":"luuhali@iz.bo","creationTime":1543648613175},{"id":"1bb37ada-963f-5e8f-b71c-7e41cd0bccca","title":"Advice on efficient code for dropdown population","content":" \nHi folks, Thanks to everyone that is so very helpful on this forum, it has helped my journey to be a little more competent with the coding on my site. \nI have been trying to expand my Wix code knowledge and increase the efficiency on the site, one area that seems to have lots of code across many pages (the same dropdowns use this code) I have around 3 for this particular input. I was wondering if it would be possible if anyone could change my thinking? Could I code it backend to reduce the code on the pages?\n\nThank you!\n\nwixData.query('dropdownPopulation')\n            .ascending(\"courseName\")\n            .find()\n            .then(res => {\n let options = [{\n \"value\": '',\n 'label': 'All Courses'\n                }];\n                options.push(...res.items.map(title => {\n return {\n 'value': title.title,\n 'label': title.title\n                    };\n                }));\n                $w('#coursenamedropdown').options = options;\n            });\n\n let opts = $w(\"#durationdropdown\").options;\n        opts.unshift({\n 'value': '',\n 'label': 'All Durations'\n        });\n        $w(\"#durationdropdown\").options = opts;\n\n let opts2 = $w(\"#dropdownDifficulty\").options;\n        opts2.unshift({\n 'value': '',\n 'label': 'All Grades'\n        });\n        $w(\"#dropdownDifficulty\").options = opts2;\n\n let opts3 = $w(\"#regionDropdown\").options;\n        opts3.unshift({\n 'value': '',\n 'label': 'All Regions'\n        });\n        $w(\"#regionDropdown\").options = opts3;\n let opts4 = $w(\"#CourseAccomodationDropdown\").options;\n        opts4.unshift({\n 'value': '',\n 'label': 'Anywhere will do'\n        });\n        $w(\"#CourseAccomodationDropdown\").options = opts4;\n\n    }\n","userEmail":"kafujca@agi.mo","creationTime":1519366601733},{"id":"279fcc64-00b3-51d6-9d09-0bae21348f0a","title":"-  SOLVED  - \nSpeed up page transitions via wixLocation","content":"Hi,\n\nI have noticed that when an onClick event is triggered within a repeater to direct to the new page this seems to be very slow, to the stage that I need to inform the user that something is happening by changing the label of the button. It takes around 2/3 second to direct to the new page.\n\nIs it possible to speed this up?\n$w('#datesButton').onClick((event) => {\n                        $w('#datesButton').label = \"Please Wait...\";\n                        wixLocation.to(\"/courses/\" + encodeURI(itemData.coursesCategory) + \"/\" + encodeURI(itemData.title) + \"#anchor1\");\n                    })\nThanks","userEmail":"zor@nonobe.tv","creationTime":1545741789829},{"id":"1cb2187a-4a4d-59c1-b271-4e9a0e6cd763","title":"How secure is wix-data in the front end?","content":"I have a data repeater which shows some of the fields of a dataset. Each object in the dataset also contains fields which I would rather not share openly. (To be specific, I am showing driver profiles with first name only, but the data collection contains last name and contact information as well, and I don't want people to access this).\n\nIn the page code, I made some custom filters which respond to user input. \nCan someone access the full contents of the dataset through their browser developer tools? If so, how can I prevent it?\n\nEDIT: Right after writing this I tried and realised how easy it is to access all the info. So I'll refer to my second question again. How can I prevent it?","userEmail":"gedekug@utenef.nz","creationTime":1532966785381},{"id":"0155919f-eb32-5ac9-ba39-7c9a4ebc0870","title":"Drag and drop (fill in the blanks)","content":"\n \nDrag the write answer to the write place.\nis it possible in wix?","userEmail":"irres@fozu.th","creationTime":1544650353781},{"id":"ef9e93d0-56f5-59cd-a0ba-908e507f29a4","title":"Fetch Post To External API","content":" How do you make a fetch post request with params to an external api ? ","userEmail":"ji@tasbud.mn","creationTime":1517287800450},{"id":"0b2ad25a-e983-5b31-9e12-1e9d95d53051","title":"Embed HTML code directly (without iframe)","content":"I’m using PressPlay2 video player, and when I embed the code using the HTML element, my video doesn’t play correctly. The problem seems to be with how the code is embedded in the page - including the embed code as an html page hosted on filesusr.com  and using an iframe to pull in that html page.\nIs there a different way to embed the video directly onto my wix site, rather than with the iframe method?\nHere’s one example of the code I’m trying to embed:\n<div id=\"ppdiv_2132813\"  class=\"pp-video-container\"  style=\"width: 100%;height: auto;\"></div><script type=\"text/javascript\" src=\"https://s3.amazonaws.com/press-play-v2/2127044/2132813/outer.js\"></script>","userEmail":"foflad@sa.py","creationTime":1522270479473},{"id":"55311d95-da11-582f-bbe6-231cf309021a","title":"The googlemap API doesn't properly render when site is published","content":"I've used the google map component successfully for many months. I have a valid google API key that works to get me locations based on a street address which I then pass to the google map component and it has properly rendered the map -- until a few days ago. Everything looks fine in preview mode, but when I publish a site, it fails to work. What happens is that the map comes up and displays the location of the Wix Office. I know that google is returning the proper data because I can use it to open a new browser window with google.com showing the map. I have a published site that I haven't touched in months that had the maps suddenly stop working a few days ago. I've had to change the site to use an html component to get an updating google map as the google-map supplied via wix seems to have changed behavior.\n\nDid a recent upgrade to wix break/change something?\n\nThanks,\nAndy","userEmail":"fiudoubo@tu.gov","creationTime":1545440195251},{"id":"e3cc65f2-36dd-56c6-9e8b-b9eae381c34c","title":"Google Maps Single Location Publish Issue","content":"Hello, I am creating a page with a dropdown to filter to a specific database item for a google map (and other info). Everything works great in preview...the map updates to a new location based on the dropdown value. In the published version, the map doesn't change locations when the dropdown selection changes. All the other items...address, image, etc...work fine in preview and publish.\n\nI know issues that pop up in publish but not preview are usually related to permissions, but the dataset loaded on the page is set to read-write, and the collection is set so anyone can make changes.\n\n \n\n\n//individual facilities code below\nlet selectedLongitude = \"\";\nlet selectedLatitude = \"\";\nexport function facilityDropdown_change(event, $w) {\n    $w(\"#facilitiesdata\").onCurrentIndexChanged((index) => {\n        let itemObj = $w(\"#facilitiesdata\").getCurrentItem();\n        selectedLongitude = itemObj.longitude;\n        selectedLatitude = itemObj.latitude;\n        console.log(selectedLatitude)\n        $w(\"#googleMaps1\").location = {\n \"latitude\": selectedLongitude,\n \"longitude\": selectedLatitude,\n        };\n    })\n}\nHelp!\n\n","userEmail":"ecmope@de.bo","creationTime":1525836233894},{"id":"503c4b7e-eaa1-516c-a6d1-e39a4e57255b","title":"Drop Down (Filling the blanks)","content":"\n \nresult like this.\nis it possible in wix?\nwhat can be helpful for this?","userEmail":"orcalla@we.pg","creationTime":1516673281101},{"id":"dc51515d-59c5-5fd4-8cc0-209b819f7f2c","title":"Cryptocurrency API help","content":"Hi,\n\nI am using a cryptocurrency API price tracker from: https://www.dunebook.com/create-a-cryptocurrency-price-update-website-using-wix-code/.\n\nThis current code allows me to pull the top 10 cryptocurrency prices from CoinMarketCap:\nexport function page1_viewportEnter(event, $w) {\ngetTopCoins().then(response => {\n$w('#coinList').text = \"Name: \" + response[0].name + \"t t\"\n+ \"Symbol: \" + response[0].symbol + \"t t\"\n+ \"Price (USD): \" + response[0].price_usd + \"n n\"\n+ \"Name: \" + response[1].name + \"t t\"\n+ \"Symbol: \" + response[1].symbol + \"t t\"\n+ \"Price (USD): \" + response[1].price_usd + \"n n\"\n+ \"Name: \" + response[2].name + \"t t\"\n+ \"Symbol: \" + response[2].symbol + \"t t\"\n+ \"Price (USD): \" + response[2].price_usd + \"n n\"\n+ \"Name: \" + response[3].name + \"t t\"\n+ \"Symbol: \" + response[3].symbol + \"t t\"\n+ \"Price (USD): \" + response[3].price_usd + \"n n\"\n+ \"Name: \" + response[4].name + \"t t\"\n+ \"Symbol: \" + response[4].symbol + \"t t\"\n+ \"Price (USD): \" + response[4].price_usd + \"n n\"\n+ \"Name: \" + response[5].name + \"t t\"\n+ \"Symbol: \" + response[5].symbol + \"t t\"\n+ \"Price (USD): \" + response[5].price_usd + \"n n\"\n+ \"Name: \" + response[6].name + \"t t\"\n+ \"Symbol: \" + response[6].symbol + \"t t\"\n+ \"Price (USD): \" + response[6].price_usd + \"n n\"\n+ \"Name: \" + response[7].name + \"t t\"\n+ \"Symbol: \" + response[7].symbol + \"t t\"\n+ \"Price (USD): \" + response[7].price_usd + \"n n\"\n+ \"Name: \" + response[8].name + \"t t\"\n+ \"Symbol: \" + response[8].symbol + \"t t\"\n+ \"Price (USD): \" + response[8].price_usd + \"n n\"\n+ \"Name: \" + response[9].name + \"t t\"\n+ \"Symbol: \" + response[9].symbol + \"t t\"\n+ \"Price (USD): \" + response[9].price_usd + \"n n\"\n});\n}\n\nApparently, the \"n n\" is supposed to create the new line, but this is the current output:\n\n \nThis is how it should look:\n\n \n\n\nDoes anyone have any idea on how I can separate the lines like shown in the above screenshot?\n\nThis is the link to my wix page:\nhttps://twistingknobs8.wixsite.com/mysite\n\nLet me know if I am missing any information and I am willing to jump on a audio/video call for a further deep dive!\n\nThanks,\nRobert","userEmail":"zawcarol@vihuj.sk","creationTime":1545695709386},{"id":"e9d4f000-d33e-504e-9442-5feafbfe3fb4","title":"Has anyone else´s custom login suddenly stopped working?","content":"Hi!\n\nSo I have used custom login and registration on my pages, which has been working fine, but suddenly today they give error 500.\n\nSo the code looks like this:\n\n \nimport wixUsers from 'wix-users';\nimport wixWindow from 'wix-window';\nimport wixLocation from 'wix-location';\n\n$w.onReady(function () {\n\n    $w(\"#loginButton\").onClick( (event) => {\n let email = $w(\"#loginEmail\").value;\n let password = $w(\"#loginPassword\").value;\n  wixUsers.login(email, password)\n  .then(()=>{\n    wixLocation.to(\"https://go-bros.wixsite.com/mysite-7\");\n      })\n        .catch((err) => {\n        console.log(err); \n        $w('#errortext').expand();\n        $w('#errorbox').expand();\n  } );\n  })  \n})\n\n\nexport function resetPassword_click(event) {\n      wixUsers.promptForgotPassword()\n  .then( ( ) => {\n    console.log(\"Password reset submitted\");\n  } )\n}\n\n\nLike I said, it has been working fine before, but now on it gives unknown error 500\non line 15, which is the line with console.log(err);\n\nIs anyone else getting the same issue?\n\nSincerely,\n\nNiko","userEmail":"dodoseb@eg.pa","creationTime":1521078362547},{"id":"407e5a76-ef18-5754-b0b5-197d0d84786c","title":"Where are Next/Previous arrows? (page Not dynamic)","content":" Hello! I am trying to put together a simple art portfolio site for my daughter. I have four tabs, Paintings, Drawings, Photography, 3D, each of which is a main page with a bunch of thumbnails. When you click on a thumbnail, it takes you to a subpage with a full size image of that drawing. I cannot figure out how to move from one full size image to the next without having to return to the main page with thumbnails:((. I am using the Graphic Illustrator template from the Portfolios collection, and in that template, there are actually Previous and Next arrows on those subpages. But on each subpage, each arrow is an actual link to the next or previous page. That means that if I later add/remove images in the thumbnail gallery, that Next arrow's link is going to take the viewer to a wrong (old) image. There has to be a more advanced way than manually rewriting all those links! When I go to the Add menu in the Editor, I can add a button (btw, the Button menu does Not have arrows), but I am not prompted to choose an Action for it, it's just am image, to which I can manually attach a link:(. The Wix support person told me yesterday that if I just put the arrow there, it will automatically \"know\" where to point. And of course, if I copy/paste an arrow from the template, it does not know anything, it just brings the old link with it, and points to a random wrong page. I need to find a button with an arrow image on it, which, when put on a subpage, would generate a link to the Next/Previous subpage. Where does that functionality come from?? Thank you.","userEmail":"wirifuba@uwru.er","creationTime":1515739687355},{"id":"89398e76-823d-58d9-943e-82c12b9f2e8f","title":"Help with Fetch & Json","content":"My apologies in advance for what is likely a basic question. Fetch and Json are new to be, as is the Corvid development environment. I am working to send JSON login information to another server via a fetch post. I have a short function (below) to do that. It calls another function that builds an array of login credentials it retrieves from a collection. I have verified that the login credentials are returned correction. No errors are reported in the debugger from this code.\n\nHow do I get at the response from the server? Nothing I have tried seems to work. Below is my current attempt.\n\nexport async function TestCode(event) {\n let loginarray = await getLoginCredentials();\n    console.log(loginarray); // I have verified login credtials coming back correctly.\n let url = [the url I am posting to];\n\n await fetch(url, {\n      method: 'post', data: JSON.stringify({\n      loginarray\n      })\n    .then((response) => {\n \n let txt = response.statusText;\n        console.log(\"Response : \" + txt); // nothing gets to the log from here no errors in debugging\n    }\n    )\n}\n\n  )\n}","userEmail":"nuhdiwodu@rig.cn","creationTime":1522202817835},{"id":"52df3d84-23e8-526c-8d57-f7b37d8d8e0b","title":"Need help pulling subscriber information","content":"I'm looking to retrieve subscriber information from the Wix Paid Plans database using an external program. My current understanding is that this can be done--we just need to pull the subscription plan name and query an email address to find if it exists as a subscriber's email address. \n\nI understand that this resource will be of use, but hoping that the process can be elaborated on by a Wix guru:  https://www.wix.com/corvid/reference/wix-users.User.html#getPricingPlans \n\nBut we're at a total loss on how to implement. Any help would be greatly appreciated!","userEmail":"wezo@de.mt","creationTime":1527197153572},{"id":"4bdd5aee-6b1d-5d1e-8407-657e790b4933","title":"Click Show, Click Hide","content":"Hi!\nI'm new at this - have got different items/IDs to show or hide on a click. I get that.\n\nNow I would like to have it so that the same ID onclick event will toggle show/hide for the same $w(...\n\nIn other words: 1. Click on an icon - show an illustration. 2. Click on that same icon - hide that icon.\n\nCan anyone help? Many thanks!","userEmail":"pegosco@wiso.tz","creationTime":1545523445645},{"id":"03ab9ab4-55ed-5093-9e90-97987eb16c1a","title":"Member pages & personalized data","content":"Hello!\n\nI am very new to Corvid and I'm not sure this is possible but I'm hoping it is and that I can do this.\n\nI'm working on creating a site for a mock clinic project I'm working on with sample patients. The patients will be the members of the site. On each member's page I want to be able to have it where they see their personalized data and trends, but I am able to enter the data on the back end for each member as needed; they see the results of that work.  \n\nI want for it to be where the member registers and this starts their page/account. But with each encounter, I enter any new stats and/or changes for them to view at their leisure.  Also need to keep a notes section for each visit.\n\nI have no idea where to begin or if that is even possible within the confines of this app for Wix.\n\nCan someon point me in the right direction or offer suggestions on where to begin? Thank you so much!","userEmail":"mocezu@gozukef.ga","creationTime":1535399471704},{"id":"88b686af-71ee-5b96-b7d5-527536b8895f","title":"Debugging scheduled jobs in corvid?","content":"Is there a way to debug scheduled jobs in Corvid?\n\nI have created a jobs.config according to the guidelines. I have tested the function I am calling and it works as expected when run manually. However, I cannot seem to get the function to run based on the schedule.\n\nThings I have  tried:\n1. I have the \"Site Monitoring\" open over periods of time when the jobs should run. No logs for scheduled events.\n2. I have created a new collection called \"Scheduled Jobs\" which I write to at the beginning and the end of the scheduled job function I call. No updates to this table when called via schedule, but works when called manually.\n\nQuestions that may help me debug further:\n1. What permission level is a scheduled job given? (Although I do have all collection writes as \"SuppressAuth\", but the module itself is restricted to \"Admin\")\n2. Does jobs.config allow comments or do I need to delete all of those (i.e., is this pure json)? Sample file had some comments throughout and no errors in the wix editor with comments.\n\nAre there any other ways to see errors from the scheduled jobs in order to help me isolate the problem?\n\nExample entry in my jobs.config file:\n// -- 9 AM --     \n{  \n\"functionLocation\": \"updateRegistrations.updateLaRegistrations\",  \"description\": \"9am Get latest registrations\", \n\"executionConfig\": {  \n    \"time\": \"13:00\" // mandatory, “hh:mm” format\n }     \n},\n","userEmail":"rigusne@doha.ir","creationTime":1541434113855},{"id":"620bc29d-7823-501d-a82a-f8cef3f1a2d6","title":"Corvid Example: Search a Database","content":"Hi everyone. Derived from the Wix Corvid example 'Search a Database', I am attempting to add query functionality to the filter function. I need the search query to filter off columns: Title, City, State, Services. The code below will only resolve queries from Title. Where am I going wrong??\n\nimport wixData from \"wix-data\";\n\n$w.onReady(() => {\n\tloadContinents();\n});\n\nlet lastFilterTitle;\nlet lastFilterContinent;\nlet lastFilterCity;\nlet debounceTimer;\n\nexport function iTitle_keyPress(event, $w) {\n\tif (debounceTimer) {\n\t\tclearTimeout(debounceTimer);\n\t\tdebounceTimer = undefined;\n\t}\n\tdebounceTimer = setTimeout(() => {\n\t\tfilter($w('#iTitle').value, lastFilterContinent, lastFilterCity);  \n\t}, 500);\n}\n\nexport function iContinent_change(event, $w) {\n\tfilter(lastFilterTitle, $w('#iContinent').value);\n}\n\nfunction filter(title, continent, city) {\n\tif (lastFilterTitle !== title || lastFilterContinent !== continent || lastFilterCity !== city) {\n\t\tlet newFilter = wixData.filter();\n\t\tif (title)\n\t\t\tnewFilter = newFilter.contains('title', title);\n\t\tif (continent)\n\t\t\tnewFilter = newFilter.contains('state', continent);\n\t\tif (city)\n\t\t\tnewFilter = newFilter.contains('city', city);\n\t\t$w('#dataset1').setFilter(newFilter);\t\t\n\t\tlastFilterTitle = title; \n\t\tlastFilterContinent = continent;\n\t\tlastFilterCity = city;\n\t}\n}\n\nfunction loadContinents() {\n\twixData.query('States')\n\t  .find()\n\t  .then(res => {\n\t  \tlet options = [{\"value\": '', \"label\": 'All States'}];\n\t  \toptions.push(...res.items.map(continent => {\n\t  \t\treturn {\"value\": continent.title, \"label\": continent.title};\n\t  \t}));\n\t  \t$w('#iContinent').options = options;\n\t  });\n\n}\n\n","userEmail":"tacoki@bauvo.pm","creationTime":1535577758559},{"id":"53b9aaa2-d100-5477-b962-7d9c121c219d","title":"How can I add price range to a product?","content":"Hello all!\n\nI run an e-commerce site where I need to show the minimum and maximum price of the products I sell. For each size, a different price is applied.\n\nThe problem is my customers commonly think the price of the product is the one that is shown before hand, that is, the minimum price. This frustrates them. :(\n\nI'd like to show the minimum price and maximum price for the products that have different variant prices on my store.\n\nCan someone help me please?\n\nE.g.  \"$5.00 - $9.99\"  or  \"From $5.00\"","userEmail":"tadut@guvnu.al","creationTime":1522343729791},{"id":"c65e6c90-6eb7-57da-bc6b-a98c9d6cefd2","title":"Custom 404 not working for dynamic page","content":"I recently created a dynamic page that lists categories from a Data Collection I created. I added a filter to this collection that works as expected.  However, what is not working is when a value that does not meet the criteria of the filter is encountered, the page does not direct to the custom 404 I created. The custom 404 does in fact work for just junk urls, but not the dynamic page. \n\nThanks for any advice!","userEmail":"zuguzni@epokewi.fk","creationTime":1542011637558},{"id":"ea1c05ea-5e6c-5021-aaad-e0c710118812","title":"How to create a graph?","content":"Hello I like to create a line graph connected to database like this:\ncan anybody tell me how?\n \n","userEmail":"notvo@emcejuz.om","creationTime":1539520952313},{"id":"29dde2ac-af10-5aac-b42d-f2f662c900c6","title":"How can I filter a repeater's content based on ALL the values recorded in a dataset and not only on the actual value?","content":"So that if at least one value in the dataset's history corresponds it shows up the item.","userEmail":"wivok@lo.mg","creationTime":1541693450438},{"id":"368ff0ad-9dd9-5b22-8f2b-760fd1ac38df","title":"TIP about getting date ranges","content":"Hey\nJust wanted to share some functions I made for getting first and last days of a month and also monday and sunday of a week. Just send any date to the functions and they will return dates for you.\nfunction getFirstDay(d){ // Returns date of first day in month\n\tvar dt = new Date(d);\n\treturn new Date(dt.getFullYear(), dt.getMonth(), 1);\n}\nfunction getLastDay(d){ // Returns date of last day in month\n\tvar dt = new Date(d);\n\treturn new Date(dt.getFullYear(), dt.getMonth() + 1, 0);\n}\nfunction getMonday(d) { // Returns date of monday in the week of date you send to the function\n  d = new Date(d);\n  var day = d.getDay(),\n      diff = d.getDate() - day + (day === 0 ? -7 : 0);\n  return new Date(d.setDate(diff));\n}\n\nfunction getSunday(d) { // Returns date of sunday in the week of date you send to the function\n  d = new Date(d);\n  var day = d.getDay()-7,\n      diff = d.getDate() - day;\n  return new Date(d.setDate(diff));\n}\nThey are nice to have when you have to calculate range in dates before making a data collection query.","userEmail":"penubos@uwup.sn","creationTime":1537188608714},{"id":"41d1a908-159b-5ac8-9028-f9937887fe0b","title":"Help with linking to a Dynamic pages anchor","content":"Hi guys as above im trying to link a button from one dynamic page to another dynamic pages anchor with code but as to match the members id , any ideas?\n\n\nIv'e tried this but doesnt work...\n\n\nexport function reviews_click(event) {\n \n    wixLocation.to(`/anchor1/${wixUsers.currentUser.id}`); \n}","userEmail":"kitijpis@colutilud.ro","creationTime":1540678685288},{"id":"f8e6b72d-48c4-59d0-9112-73229e1812f6","title":"upload button","content":"Hello everyone,\nIs there a way to add/code an upload input/button, where the user can add several images, as apposed to only one?\nThank you\nTal\n","userEmail":"inuama@nam.bg","creationTime":1534885631225},{"id":"0ab75189-4a33-5b2a-8ed2-d86b8bde3965","title":"Updating specific fields","content":"Someone has asked recently (I don't remember who) how to update specific fields of a record without having to pull all the other fields to the front end.\nSo I've posted a simple (a little bit trivial) solution here:\n https://jonatandor35.wixsite.com/test/post/how-to-update-specific-fields  ","userEmail":"fusjohwi@cut.gh","creationTime":1533693592458},{"id":"9d1ff6ee-b537-5747-ad58-8663fbc1fc83","title":"Trouble adding LinkedIn Company Follow Button","content":"I'm having trouble adding a LinkedIn Company Follow button.  I went to this LinkedIn page where it generates code for you to add this button to your site: https://developer.linkedin.com/plugins/follow-company\n\nThis is the code they gave me:\n\n<script src=\"//platform.linkedin.com/in.js\" type=\"text/javascript\"> lang: en_US</script>\n<script type=\"IN/FollowCompany\" data-id=\"27193937\"></script>\n\nBut I can't seem to add it to my Wix site.\n\nPlease help.\n\nThanks!\n\n-Noah","userEmail":"nimwa@ogela.dm","creationTime":1546281365946},{"id":"1e0205cc-e243-5f0c-95f9-b679c962bd7c","title":"Image Component in a Repeater is not updated when added via code","content":"The problem: I'm trying to get the image component placed inside a repeater to display the avatars images of each of the members it was loaded into the repeater array.\n\n \n$w(\"#myRepeter\").data = results.items; // This is an array resulting from the return of a query.\n$w(\"#myRepeter\").onItemReady(($item, itemData, index) => {                     \n\n$item(\"#imgMembro\").scr = itemData.picture;\n$item(\"#textName\").text = itemData.name;                 });\n\n}); \n\n\nNote that the content of $item(\"#imgMember\").scr is updated correctly with the content of itemData.picture\n\nWhy then are the images not updated on the repeater?","userEmail":"pij@egme.ph","creationTime":1538627351470},{"id":"386784c4-971d-543b-b8c4-85716db5eaef","title":"Member Login Bar / Login Lightbox not working ","content":"Hi there, \n\nI have created a custom login lightbox so that when the members login bar (wix app) is clicked the lightbox appears, users input their email and password and click 'Login'. Once 'Login' is clicked they should be redirected to the Home page. \n\nThe issue is that everything works up until clicking the lightbox 'Login' button then nothing happens! No redirect and the user does not get logged in. The member login bar does not change to show the users profile picture and name and provide the drop down menu allowing them to log out. I am using registered information that I can see exists in the members database so I should be able to login with that information. \n\nI have copied the code I am using below - code was taken from a Code Queen Tutorial: https://www.youtube.com/watch?v=QbH8_eudjbE\n\nimport wixUsers from 'wix-users';\nimport wixLocation from 'wix-location';\nimport wixWindow from 'wix-window';\n\n$w.onReady(function () {\n $w(\"#forgotPassword\").onClick( (event) => {\n //wixWindow.lightbox.close()\n   wixUsers.promptForgotPassword()\n   .then( ( ) => {\n //\n   } )\n    .catch( (err) => {\n let errorMsg = err;  //\"The user closed the forgot password dialog\"\n    });\n });\n});\n\nexport function loginButton_click(event) {\n\n let email = $w(\"#email\").value;\n let password = $w(\"#password\").value;\n\n wixUsers.login(email, password)\n   .then( () => {\n     console.log(\"User is logged in\");\n     wixLocation.to(\"/home\");  //Change the URL ending to whatever page you want to send the user to after they log in.\n   } )\n    .catch( (err) => {\n     console.log(err);\n     $w(\"#errorMessage\").expand();  // You can delete this line if you are not going to add an error message.  Use a regular text element set to 'collapse on load' from the Properties Panel.\n   } ); \n}","userEmail":"fosreflad@kitorga.fj","creationTime":1524898478006},{"id":"d813ca03-dfc0-5626-a43c-9d5cf8d2cb7e","title":"Does Wix have middleware?","content":"Sorry if this is a \"n00b\" question. I'm new to website building, HTML, web design, etc. I recently created a website for a housing community. One of the board members of the community asked what Middleware & Hosting service I used.\n\nI obviously knew about the Hosting and informed him of Wix. However, does Wix have middleware and/or can someone please explain to me what that is?\n\nThanks!  \n","userEmail":"tirfizpo@nehog.gu","creationTime":1539318395231},{"id":"b7f0e9e6-06f2-5abc-b534-4664d1688d57","title":"How do you add Ads.txt to a Wix site?","content":"What it says in the title. More info on Ads.txt available here.\n> https://www.quora.com/Do-I-need-to-add-Ads-txt-to-my-website-when-I-am-only-running-AdSense\n>https://support.google.com/adsense/answer/7532444?hl=en\n\nBut yeah, I have the txt file written out, my problem now is putting it on my website and redirecting the adsense crawler to dantetranslation.com/ads.txt (which currently does not exist, I don't know how to create it and redirect it to my txt) \n","userEmail":"kotufuf@wafa.mv","creationTime":1528689573253},{"id":"dd63145f-6340-5fa7-8619-2f44dbf63fd7","title":"help me","content":"pls i have been trying to run code on a dynamic page but it is not working, i need help pls. thanks","userEmail":"rotif@suob.sh","creationTime":1514809791415},{"id":"3680ee4f-b510-5b18-b1fe-bf6b2ff32770","title":"Adding Ads.txt file","content":"Hi, \n\nI have a new blog that's been up for a couple of months and would like to hook up an ads.txt file so that we can make a few cents to offset the work we're putting into this.  I asked for help via the support team but they told me to vote for a feature that did this and sent me here.\n\nWe've had an ads.txt file provided to us which should be able to found here https://<my website>/ads.txt, the same place as https://<my website>/robots.txt (though this in internally generated).\n\nI'm at a loss for how to do this as I've looked for documentation on how and haven't come up with anything.\n\nCan anyone help and/or offer any insight on a direction to move in?\n\nMuch appreciated,\nJenny\n\n\n\n\n","userEmail":"posfen@jak.gr","creationTime":1520169499590},{"id":"ef693c5d-295d-5c61-bf4b-8cb192bd863c","title":"Adding a graphic pie from a table or dataset","content":"  \nHello,\nHow can I add a simple pie from table in a dynamic page ?\n\nThanks for your help\nRegards\nPierre-yves\n\nSuch as in Excel:\n\n \n\n\n","userEmail":"pazog@kebog.jo","creationTime":1534896832042},{"id":"5d4c176e-9dce-5a2d-ba60-39cd5c420929","title":"Chart that displays content of a table","content":"Hi Wix Experts \n\nCan you please suggest a code example for creating a dynamic chart based on table data from collection?\nFor example - lest say that i have a table in my page that is connected to a collection, and that table has a filter that eventually presents 10 rows and few columns with data.\ni want those 10 items values (from a relevant column) to show in a \"dynamic\" line chart.\n\nThanks,\nRoy\n","userEmail":"sacofis@ceanofe.pe","creationTime":1539318894644},{"id":"96393b75-d21e-5dfc-88ff-5785f169d45f","title":"How to publish latest row of content for different fields?","content":"I'm asking my clients to upload 3 media files. And they can change/modify it whenever they want. So its a form with 3 Image/Video input fields. And I want them to upload as many times as they want but the form will only display the latest set of images/videos.\n\nEvery time they update, image1, image2 and image3.... it gets updated as a new row in the database. Problem is, how do I display latest set of image1, image2 and image3? Especially when clients update only 1 or 2 images at a time and not the entire row.\n\nExample:\nOn Day 1, client uploads image1, image 2 and image3. Form should display those 3 media files.\nOn Day2, client decides to update only image3. Database creates a new row where image1 and image2 are NULL/empty. Image3 has the new image. How can my form display image1 and image2 from Day1 and image3 from Day2?\nI've tried using sort and filter in dataset element but that filters the entire row. And not for individual media files.\n\n","userEmail":"jopzu@mejoto.mr","creationTime":1529330962390},{"id":"8dd47375-6d4a-5f08-87fd-c2a583f1140c","title":"Is wix capable of creating a web socket?","content":" Hi guys, may I ask about is there any way to make changes to an already open web page (new tab or window), from another page (different tab/window)?\nI am doing a prototype for restaurant pos system, which I want to show customer view and cashier view at the same time on different screen (dual screen), and the changes in cashier view will affect customer view instantly. \nOr is there other way to achieve my objective? \n\nSome people are telling me about web socket, so I try to search for web socket in wix, but I did not find what I want.","userEmail":"oj@osu.is","creationTime":1522220157320},{"id":"fca020a1-523a-52f8-b3f4-a64d9f9223ec","title":"text-align in html for text","content":"I can't get the text to be aligned.\n$item('#text13').html = \"<span style=' text-align:center; color:\"+itemData.textColor+\"; font-size:16px; font-family:helvetica; font-weight:bold;'>\"+itemData.shortName+\"</span>\";\nEverything works fine, expect the align.","userEmail":"zefdewos@nodilpeb.md","creationTime":1518840308043},{"id":"043fa86c-09a4-5053-bab8-91cd20bbb08c","title":"Notifications not working","content":"Hi I was working with wix crm backend notificatication and just stoped working.\n\nSee the code bellow\n\nCRM Backend code\n\nimport wixCrm from 'wix-crm-backend';\n\nexport function notifySiteContributors(body, titulo, acao, url) {\n wixCrm.notifications.notify(\n body,\n        [\"Mobile\", \"Browser\", \"Dashboard\"], {\n \"title\": titulo,\n \"actionTitle\": acao,\n \"actionTarget\": { \"url\": url },\n \"recipients\": { \"role\": \"All_Contributors\" }\n    })\n}\n\n\n\nfrontend code\n\nimport { notifySiteContributors } from 'backend/CRM';\n\n\nexport function botaofinalizar_click(event) {\n let itemObj = $w(\"#dataset3\").getCurrentItem();\n let os = itemObj.title.replace('/', '%2F')\n let link = 'www.otimicar.com/respostas-cotacao-pecas-/' + os\n $w('#text217').show()\n notifySiteContributors(\n String('OS ' + $w('#osText').text + ' ' + $w('#text207').text + ' ' + $w('#text208').text + ' ' + $w('#text214').text),\n String('Cotação de peça respondida por ' + $w('#text223').text),\n 'VEJA AGORA A RESPOSTA',\n link)\n}\n\nThe error =>\n\n\nUnhandled rejection Error: server responded with 400 - {\"message\":\"\",\"details\":{}}     at handleServerError (/dynamic-modules/edm_root/2b595510-de9c-11e9-aaa2-279ac5c14f62/node_modules/@wix/wix-crm-backend/src/notifications/api.ts:162:11)     at Object.<anonymous> (/dynamic-modules/edm_root/2b595510-de9c-11e9-aaa2-279ac5c14f62/node_modules/@wix/wix-crm-backend/src/notifications/api.ts:109:9)     at Generator.throw (<anonymous>)     at rejected (/dynamic-modules/edm_root/2b595510-de9c-11e9-aaa2-279ac5c14f62/node_modules/@wix/wix-crm-backend/dist/src/notifications/api.js:5:65)     at bound (domain.js:396:14)     at runBound (domain.js:409:12)     at tryCatcher (/elementory/node_modules/bluebird/js/main/util.js:26:23)     at Promise._settlePromiseFromHandler (/elementory/node_modules/bluebird/js/main/promise.js:510:31)     at Promise._settlePromiseAt (/elementory/node_modules/bluebird/js/main/promise.js:584:18)     at Async._drainQueue (/elementory/node_modules/bluebird/js/main/async.js:128:12)     at Async._drainQueues (/elementory/node_modules/bluebird/js/main/async.js:133:10)     at Immediate.Async.drainQueues [as _onImmediate] (/elementory/node_modules/bluebird/js/main/async.js:15:14)     at runCallback (timers.js:705:18)     at tryOnImmediate (timers.js:676:5)     at processImmediate (timers.js:658:5)     at process.topLevelDomainCallback (domain.js:121:23)\n\n\n\n","userEmail":"humpatok@weamvu.ai","creationTime":1531424040238},{"id":"a00ae130-aec3-56d4-a859-c0e9902ab122","title":"Table with images that show a popup of the image when clicked?","content":"Hi,\n\nI have a table connected to Dataset on a dynamic page. The table contains a column of images.\n\nI'm trying: when an image is clicked show a popup of the image.\n\nI did the following steps:\n\n1. Get the image data by creating an onCellSelect event, open a lightbox and send the image source to the lightbox. This code should be added to the page section where the table is added: \nimport wixWindow from 'wix-window';\n\nexport function table1_cellSelect(event, $w) {\n\t\tlet cellData = event.cellData; \n\t\t\n\t\t//the cell containes an image\n\t\tif (cellData.indexOf(\"image://\") !== -1){\n\t\t\twixWindow.openLightbox(\"lightbox\", cellData);\t\t\t\n\t\t}\n}\n2. Create a lightbox and add an image as a placeholder.\n3. Get the image source using the getContext function and change the image source to the received image data. This code should be added to the page section of the lightbox: \nimport wixWindow from 'wix-window';\n\n$w.onReady(function () {\n\t\n\tconst recievedImage = wixWindow.lightbox.getContext();  \n\t$w('#image1').src = recievedImage;\n});\n*events: table1 onClick - table1_cellSelect\n\nI'm getting the error:\nTypeError: Cannot read property 'indexOf' of undefined\n\nPlease help  !","userEmail":"le@ni.ar","creationTime":1523670611196},{"id":"f94a986f-7861-55c6-af22-6b8d51131355","title":"blocked by CORS error","content":"All of the sudden I started getting:\nAccess to XMLHttpRequest at 'https://www.wix.com/_api/wix-laboratory-server/laboratory/conductAllInScope?scope=wix-form-builder' from origin 'https://www.mydoamin.com has been blocked by CORS policy: No 'Access-Control-Allow-Origin' header is present on the requested resource.\n\n\nAnd it's not limited to a specific site. I tested in 2 of my websites on different pages.\nAre you experiencing it too?","userEmail":"ze@voz.ba","creationTime":1536093540302},{"id":"d2b196e0-162b-5c47-a10d-f17af0a10d58","title":"Button on my dynamic page linked to other page's anchor.","content":"I have a button on my dynamic page linked to an anchor on another page, I can link the button to the page's anchor but the button doesn't work. If the button from a regular page is linked to the page's anchor, it works. But the button from dynamic page linked to the page's anchor, it doesn't work.","userEmail":"lofe@ofopifvib.hu","creationTime":1535305008366},{"id":"b4d668ee-2b39-54ed-aea7-dec98953b433","title":"Collapsable menu not collapsing","content":"I've followed an example point for point to add a collapsable menu on my website - everything works except that it won't collapse - any ideas where i have gone wrong?\n\n \n \n\n\n\n","userEmail":"bozta@di.id","creationTime":1519178127140},{"id":"6f02a640-8636-5ed5-a8c0-58a1277d987a","title":"Shortcut to move element in front of another element without attaching to the back element ?","content":"is there a keyboard shortcut to avoid attaching element to the back element ? \n\nfor example: move a text in front of a slideshow without attaching the text inside slideshow's slide so that the text will not move as slides move\n\ni've tried to hold ctrl while move, tried shift, tried alt\n\ncurrently i'm using keyboard arrows to move the front element to avoid attached to the back element, and sometimes using align tool in toolbar\n\nsorry for often posting questions, this because i l❤ve working with wix to build client's websites, and for someone who think this not a corvid related, i've enabled dev mode while doing this  L🤣L ","userEmail":"teki@em.jm","creationTime":1520477186513},{"id":"01641862-0bab-51b6-9a06-dbbd83a76804","title":"I can't make Toggle Button \"Show More/Show Less\" \n","content":"hello everyone\nI can't make Toggle Button \"Show More/Show Less\" \n\nhttps://support.wix.com/en/article/creating-an-expandable-text-box-with-a-show-more-link-using-wix-code#working-with-dynamic-text\n\nI used code\nlet fullText;\nlet shortText;\n// For full API documentation, including code examples, visit https://wix.to/94BuAAs\n\n$w.onReady(function () {\n  const shortTextLength = 40;\n  $w(\"#dynamicDataset\").onReady(function () {\n    fullText = $w('#dynamicDataset').getCurrentItem().description;\n    // if no text to display, collapse the text element and the button\n    if (!fullText) {\n      $w('#text5').collapse();\n      $w('#button13').collapse();\n    } else {\n    // if the text has fewer or the same number of characters as shortTextLength characters, display it as is and collapse the \"Show More\" button\n      if (fullText.length <= shortTextLength) {\n        $w('#text5').text = fullText;\n        $w('#button13').collapse();\n      } else {\n      // create the shortened version of the text and display it in the text element\n        shortText = fullText.substr(0, shortTextLength) + \"...\";\n        $w('#text5').text = shortText;\n      }\n    }\n  });\n\n});\n","userEmail":"atuho@hat.sz","creationTime":1536389623692},{"id":"e3915dcf-fb6a-55dd-89b9-6b995e803e4f","title":"after/beforeInsert hook not available ","content":"I'm trying to build a beforeInsert hook on a data collection of permission type \"Custom Use\", however, it seems as if this lifecycle hook is not available on this permissions type. I have all of the other lifecycle hooks available, just not this one. \n\nIs there anyway to have this hook type available for these data collections?","userEmail":"ducpepog@lipdapiwe.tk","creationTime":1529076014646},{"id":"c9140d28-0e40-5402-ac40-19335d20bd8a","title":"Collapsing strip column's bug ?","content":"in editor preview, collapsing left side / previous column does makes the right side / next column goes to the left, but in live site it's not, is it a bug ?","userEmail":"cuhvu@ocoji.gb","creationTime":1521795531709},{"id":"22a67301-b552-553e-bc5c-4f9944d53785","title":"Contact Form Webhooks","content":"Hi Guys,\nI am an integrator and have many clients that use Wix. The issue im encountering is that there is no simple way to grab a contact form submission and send the data via post to an endpoint.\nI went through the documentation but couldnt find anything remotely close to what I am looking for.\nWould appreciate some guidance here if possible :).\n","userEmail":"tap@dofre.kg","creationTime":1529027943340},{"id":"4ab440ce-19a4-50be-a1a9-f1dbfe1372bd","title":"Dynamic pages link not working...Please help","content":"Hello everyone.\nIf some one can help me please, I'm really frustrated with this problem, I tried all bit and pieces but nothing work out, if any one of you can help me will be deeply appreciated.\n\nThis is regarding the dynamic page link not working in live environment.\nId values in sandbox /Live collection mode is not matching with the id values showing in the URL of live environment and hence the result is \"404 - Page not found\"\nI have sync with Live data, Publish the Live date in collection databases , but all this doesn't resolve my issue.\nI have used the below code to direct to Dyanamic page in page\n \nwixLocation.to(`/members-signup/update/${wixUsers.currentUser.id}`);\n   } )\n\nMany Thanks\nSushant Malviya\n\n\n\n\n\n\n","userEmail":"za@duppe.et","creationTime":1535940371235},{"id":"cf889f81-8d69-5a47-9b7f-d281241f6d36","title":"Javascript is displayed on wrong place","content":"The Javascript is displayed over my head, but of course it should be among them.\nIt´s strange, because there are the adjustment options \"Head\", \"Body-Start\" and \"Body-End\", but the setting has no effect.\n\n<script src=\"https://dev.fgimmobilien.de/js/api.js\" type=\"text/javascript\" id=\"fgIframe\" data-api=\"17eb108a288eb5545b481d5a46a6116a\"></script>\n\nI need help thank you!\n\nBest regards\nLudwig Holzapfel","userEmail":"ve@sut.ms","creationTime":1529716145391},{"id":"850865d9-03ac-512a-8a6e-3db5380224df","title":"Multiple Expandable Text Boxes : Error","content":"I have followed the wix code forum guide to employ \"expandable text\" boxes on my site.  Although the code works perfectly with one expandable text box - it seems to fail when another is added to the page.\n\nI've added the code below.  Basically, box #1 has the correct short-text (first 30 characters pulled from it's corresponding largetext box).  However, when I click the \"show more\" button, it then populates it with the short text from button 2, and then the long/full text from button 2.\n\nIf I was to add a third button, this would happen with both the first and second button... (they would look correct upon the page loading, but once the button is clicked - would populate from the third text box).\n\nAny ideas on how this can be resolved?  Much appreciated!\n\n\nlet fullText; // variable to hold the full text\nlet shortText; // variable to hold the short version of the text\n\n$w.onReady(function () {\n // how many characters to include in the shortened version\n const shortTextLength = 30;\n // read the full text and store it in the fullText variable\n    fullText = $w(\"#text17\").text;\n // grab the number of characters defined in shortTextLength and store them in the shortText variable\n    shortText = fullText.substr(0, shortTextLength) + \"...\";\n // set the contents of the text element to be the short text\n    $w(\"#text17\").text = shortText;\n\n});\n\nexport function button6_click(event, $w) {\n // check the contents of the text element \n if ($w(\"#text17\").text === shortText) {\n // if currently displaying short text, display the full text\n        $w(\"#text17\").text = fullText;\n        $w(\"#button6\").label = \"Show Less\";\n    } else {\n // if currently displaying full text, display the short text\n        $w(\"#text17\").text = shortText;\n        $w(\"#button6\").label = \"Show More\";\n    }\n}\n\n$w.onReady(function () {\n // how many characters to include in the shortened version\n const shortTextLength = 40;\n // read the full text and store it in the fullText variable\n    fullText = $w(\"#text22\").text;\n // grab the number of characters defined in shortTextLength and store them in the shortText variable\n    shortText = fullText.substr(0, shortTextLength) + \"...\";\n // set the contents of the text element to be the short text\n    $w(\"#text22\").text = shortText;\n\n});\n\nexport function button7_click(event, $w) {\n if ($w(\"#text22\").text === shortText) {\n // if currently displaying short text, display the full text\n        $w(\"#text22\").text = fullText;\n        $w(\"#button7\").label = \"Show less\";\n    } else {\n // if currently displaying full text, display the short text\n        $w(\"#text22\").text = shortText;\n        $w(\"#button7\").label = \"Show more\";\n    }\n}\n\nexport function button8_click(event, $w) {\n if ($w(\"#text24\").text === shortText) {\n // if currently displaying short text, display the full text\n        $w(\"#text24\").text = fullText;\n        $w(\"#button8\").label = \"Show less\";\n    } else {\n // if currently displaying full text, display the short text\n        $w(\"#text24\").text = shortText;\n        $w(\"#button8\").label = \"Show more\";\n    }\n}","userEmail":"kiaza@tadensa.sa","creationTime":1516330468464},{"id":"2c172d1b-96e2-5f8c-b7c2-236c3ef2106d","title":"Little help with js code","content":"\nTrying to do a simple age calculator,for some reason the code can't recognise the birthDay field from the database,although it is written exactly as it is.\n\nCan anyone point me in the right direction?\n\n \n \n\nI got a datepicker user input for the birthday part and a text for the age box display,both connected to the database\n\nimport wixData from \"wix-data\";\n\n\n$w.onReady( async function () {\n \n var dobms = $w(\"#dataset1\").birthDay.value.valueOf();       \n var nowms = Date.now();\n var age = Math.floor((nowms - dobms) / (365.25 * 24 * 60 * 60 * 1000));\n    $w(\"#ageBox\").text = age.toString();\n});\n\n\n\nThank you","userEmail":"ra@co.gr","creationTime":1526078037554},{"id":"0097fb7e-8024-552b-b301-e32bd5be633f","title":"Smooth transition when changing image element's src","content":"currently i build a custom product gallery page with repeater\ni'm trying to mimic the way deault productGallery change image when hover and just did it, but the way image changes is not as smooth as default productGallery as it has no transition effect,\nis there a way to add transition when changing src value ?\nperhpas not just for image element src but also another element's background src \n\nhere's my current code :\n$item(\"#productContainerElt\").onMouseIn(() => {\n\tif (itemData.mediaItems[1]) { $item(\"#productImageElt\").src = itemData.mediaItems[1].src }\n})\nproductContainerElt is container inside repeater and productImageElt is image element inside repeater container","userEmail":"ba@ori.af","creationTime":1521239164859},{"id":"04890090-94d9-5130-a057-4c891b652c59","title":"Character Spacing for nav text","content":"Hey! It's a little baffling that it is not possible to adjust the character spacing for menu text in the basic editor. Has anyone found a way around this? This is weirdly a deal breaker for me so any magical solutions here would be lovely :)","userEmail":"me@cem.lu","creationTime":1530878802309},{"id":"c5069a9f-9147-5087-b9d1-2eb1dd5f7109","title":"Issue with Sign Up / Login Buttons","content":"Hi everyone,\n\nIm having issues with Wix Corvid and the specific issue is that my sign up and login buttons don't seem to be working anymore. My code seems okay from what i remember but now they dont work. The buttons just seem to be dead. Any ideas? ","userEmail":"seffuz@zanbo.su","creationTime":1538064081982},{"id":"e7ce2133-5132-5250-a70f-d8f0062222da","title":"Custom member signup","content":"I am trying to create a custom signup in a lightbox. This is the code I have used however it does not seem to submit the new member or navigate to the next page. Is anyone able to tell me where I have gone wrong?\nThanks \n\nimport wixUsers from 'wix-users';\nimport wixLocation from 'wix-location';\n\n \n$w.onReady(function(){  \n    $w('#register').onClick(function (){    \n let email = $w('#email').value; \n let password = $w('#password').value;   \n        wixUsers.register(email,password)   \n        .then(()=>{\n            wixLocation.to('/create-profile'); \n            })\n        })\n    })\n\n","userEmail":"guhmut@ciutana.wf","creationTime":1522785135658},{"id":"2002fa38-e9f8-5e26-92ed-4b2710b9ff42","title":"Character Spacing in Header","content":"Hi, I'm just wondering if it is possible to code character spacing for menu titles in header?\nThanks","userEmail":"olowazip@henunnen.mk","creationTime":1515678675129},{"id":"fe720acd-322c-5a82-a5bb-09573f53de51","title":"Showing books from Goodreads or LibraryThing","content":"I inserted the html code provided by Goodreads or LibraryThing to display books I currently own. It shows well but, whenever I click on a book cover to see book details, nothing happens. I'm puzzled. This is a sample of the code inserted:\n<div id=\"w65f9d7b558311a7f270e0547d6532a7e\"></div><script type=\"text/javascript\" charset=\"UTF-8\" src=\"https://www.librarything.com/widget_get.php?userid=LicAC&theID=w65f9d7b558311a7f270e0547d6532a7e\"></script><noscript><a href=\"https://www.librarything.com/profile/LicAC\">My Library</a> at <a href=\"https://www.librarything.com\">LibraryThing</a></noscript>","userEmail":"riwpebun@avewukop.cc","creationTime":1535683336529},{"id":"b57beec7-19b7-5238-8c6c-55d27edf461e","title":"Can't connect images for product variants / product options from CSV file","content":"[1] - is i miss something or is it currently not possible to connect the product variant image trough csv ?\n[2] - for product variants, is it possible to set surcharge for every single variant option instead of whole variant ?\n[3] - is there a way to make the product variant option dropdown disabled until other variant option dropdown selected ? something like this  https://www.reecesafety.co.uk/brass-padlock-32mm.html ","userEmail":"vefur@igaje.hu","creationTime":1524645986856},{"id":"acf2a6a6-ae17-526c-aa2b-ec4f17116293","title":"[solved]wix Dataset's .setPageSize( ) not working. ","content":"Hello wix Forum! I was trying to use the .setPageSize() function, to change the number of items to display of my dataset. I read in the documentation that this function can modify this value.\nAfter several failing attempts I decided to try the code in a clean page, I copied the example code in the APi documentation and added a .getPageSize() to see if the change was happening. here is the code:\n\n$w.onReady(function () {\n //TODO: write your page related code here...\n  $w(\"#dataset1\").setPageSize(6)\n  .then( () => {\n    console.log(\"Page size set.\");\n  } )\n  .catch( (err) => {\n let errMsg = err.message;\n let errCode = err.code;\n  } );\n  let val = $w('#dataset1').getPageSize()\n  console.log(val)\n});\nI run it various times and it didn't worked. \nI read in the documentation that: \n\"Calling setPageSize() on a read-only dataset causes an error.\" \nso I checked with my dataset and it was set to \"read-only\" by default but it doesn't give an error, but I noticed that it does gives an error when you set the dataset to \"write-only\". I think that maybe they put \"read-only\" instead of \"write only\" by mistake in the documentation.\nbut the real problem is why .setPageSize() doesn't work, is it a bug? am I doing something wrong? if so please explain to me the right way to use this function because I really need it for my page.\nbelow is a video showing what I did.\nthanks in advance.\n\n \n","userEmail":"lonidgi@robzap.ye","creationTime":1527100119585},{"id":"bffc56e2-f949-535f-9383-b85dcd9ff5e8","title":"WixDataQuery - FUNCTIONS - ne()","content":"Someone has some code example using the ne () function passing an array to it.\n\nI am trying to understand how this function works when we pass an array to it.\n\n#WixDataQuery\n#ne()","userEmail":"elofum@zofhupa.cv","creationTime":1540850061527},{"id":"63e9c07a-6d89-56f7-9f85-5488acc19b2f","title":"Customized Sign Up form for customers creates a new member not linked to the customer","content":"Dear Wix community,\n\nI've used the following tutorial (https://support.wix.com/en/article/how-to-create-a-custom-registration-form) to create a customized Sign Up form for my customers after cart checkout. The issue is that this Sign Up creates a member that is not connected with the customer contact. And the customer can't see his orders nor his personal information after login.\n\nThanks for your help.\n\nNerder","userEmail":"iwoma@ectiv.ao","creationTime":1523071858262},{"id":"fd31a6ff-91d2-52e4-9de0-f27105f25d81","title":"Custom Payment for Wix pay API (Pay Flow) - Need for Client by tonight.","content":"Hi All,\nI have been trying this code on this page for 2 days now:\nhttps://www.wix.com/corvid/forum/community-discussion/custom-payment-amounts-with-pay-api\n\nI have been modifying this example along with it:\nhttps://support.wix.com/en/article/corvid-tutorial-using-the-corvid-pay-api-to-collect-payments-for-a-single-product\n\nhttps://www.youtube.com/watch?v=YJuYl47tjxs\n\n\nIt doesn't work when I modify the example. I am using Square as my payment portal. My client wants this by tomorrow morning EST. I even tried modifying the code to have a construct field. Here is my current code:\nPAGE CODE\n\nimport wixPay from 'wix-pay';\nimport {createMyPayment} from 'backend/BE_PayAPI';\n\nexport function button1_click(event) {\n    createMyPayment($w('#input1').value,$w('#input2').value)\n const invoicenumber = `${$w(\"#input1\").value}`;\n const customamount = `${$w(\"#input2\").value}`\n         .then( (payment) => {\n      wixPay.startPayment(payment.id);\n    } );\n}\n\nBACKEND CODE\nimport wixPay from 'wix-pay-backend';\nexport function createMyPayment(invoicenumber,customamount){\n let cPaymentString = { amount: customamount, \n        items: \n        [{name: invoicenumber, price: customamount}] };   \n return wixPay.createPayment(cPaymentString);\n}\n\n\n\nI am using an example site right now so details might not match branding.\nMy URL: https://andrew0657.wixsite.com/mysite-1\nAny insight tonight would be beyond helpful!","userEmail":"zesoz@ubocej.hn","creationTime":1522719394911},{"id":"64d7c70a-3dfc-5e52-a6bc-5f3e71d50417","title":"Conditional User Input Drop Down not showing all data from dataset","content":"I am currently building a form and one of the user input drop down is not showing all the data from the dataset (ie regions. only 5 out of 10 are showing). I presumed that maybe there were some issues with the CSV file used to populate the dataset, but after making sure that all is as it should be it is still not working as it should (i tried using a CSV file, MS DOS CSV file, a MAC CSV file but the same problem occurs). Anyone has any idea what could be the issue here?\n\nBelow is the code for the page:\n\nimport wixData from 'wix-data';\n\n$w.onReady(function () {\n    populateRegion();\n    populateCommune();\n\n});\n\nfunction populateRegion(){\n\nwixData.query(\"Region2\")\n.find()\n.then(results => { \nvar uniqueList = createUniqueList(results.items);\n$w(\"#iptRegion\").options = buildOptions(uniqueList);\n})\n\nfunction createUniqueList(items){\nvar titlesOnly = items.map(item => item.region);\ntitlesOnly.sort();\nreturn[...new Set(titlesOnly)];\n}\n\nfunction buildOptions (uniqueList){\nvar uniqueListFinal = uniqueList.map(curr => { return {label :curr, value:curr}; });\nreturn uniqueListFinal;\n\n}\n}\nfunction populateCommune(){\n\nwixData.query(\"Region2\")\n.eq('region',$w(\"#iptRegion\").value)\n.find()\n.then(results => { \nvar uniqueList = createUniqueList(results.items);\n$w(\"#IptCommune\").options = buildOptions(uniqueList);\n})\n\nfunction createUniqueList(items){\nvar titlesOnly = items.map(item => item.commune);\ntitlesOnly.sort();\nreturn[...new Set(titlesOnly)];\n}\n\nfunction buildOptions (uniqueList){\nvar uniqueListFinal = uniqueList.map(curr => { return {label :curr, value:curr}; });\nreturn uniqueListFinal;\n\n}\n}\n\n\nexport function iptRegion_change(event) {\n    populateCommune(); \n    $w(\"#IptCommune\").enable();\n}\n\nHere is what the dropdown shows.\n\n \n\nHere's the CSV file used to populate the dataset\n\n \n","userEmail":"co@toiru.cx","creationTime":1539392190605},{"id":"3bd11934-5c61-5631-91e5-bd4aa26bbf3a","title":"Member’s Login Session Token Help – Better Wix Coding From Lessons Learned","content":"  \nThis is a simple solution with a longer explanation … \nI thought I should post this to help those whom are using login session tokens on their sites (for their member’s area [aka site’s customers] logins). Most coders are familiar with uncovering nuances and revelations after multiple tries and/or reads on docs. That isn’t an always case, but it does happen. \n\nI recently encountered a situation that is mentioned in Wix docs but not apparent in whole; which is regarding session tokens to login a user. Basically, for a session token type login, there is frontend code that completes the login and there is backend code that initially gets/generates a session token. This type of usage is needed for remote and/or 3rd party type logins. \n\nThe nuance I discovered is that in the second step, which is to complete the login from the frontend, you need to utilize a frontend function (‘onLogin()’) from the ‘wix-users’ library.  This is because the ‘wix-users’ library should be used once the page is loaded, which can be utilized through the ‘onReady()’ event-handler like ‘$w.onReady()’. This is clearly announced in the Wix docs, while the part that a login success (completion) technically is its own promise, and thereby needs to be called is not so apparent. The login from the frontend Wix is a void type promise. Moreover that, those who are familiar with browser usage would know that there is information being exchanged in order to have a completed login that will maintain a session’s persistence throughout the member’s usage. Therefore, we need to utilize the ‘onLogin()’ in order to provide seamless usage for a member we are logging in. This is helpful if we are handling code that needs the user logged and/or want to move to other pages that are member-area restricted. \n\nAs mentioned, this is easy to handle, as you can see in the code below. I have provided the two optional ways to do this – via Email & Password -OR- Email only.\n\n-------------------- THIS IS BACKEND CODE (start) --------------------\n// Published 2019-09-23\n/// Make sure to check for new updates in Wix docs\n/// API-Reference: https://www.wix.com/corvid/reference \n/// Help-Center: https://support.wix.com/en/article/corvid-security-considerations (search from top-right bar)\n\n/// Place this file in \"backend\", and name this file: 'login.jsw' -- otherwise use any unique name, but remember to change it in the front-end (page's) code.\n/// Using \".jsw\" identifies this as a Web-Module (node_modules), which allows to bring in other (outside) code repositories and services - e.g. Twilio, etc.\n\n\nimport wixUsers from 'wix-users-backend';\n\n/*********************************\n * backend-side login code *\n *********************************/\n\n/// Option-1 with both Email & Password.\n/// This Exported Function will GET a session token from both an email & password input. \nexport function getLoginToken(email, password) {\n return wixUsers.login(email, password)\n        .then((sessionToken) => {\n return { \"sessionToken\": sessionToken, \"approved\": true };\n        });\n} // End of Exported-Function 'getLoginToken'\n\n\n/// Option-2 with Email Only.\n/// This Exported Function will GENERATE a session token with only the email input. \n/// This is not my preferred way, but may be the only (wix avail) option for things like 3rd party auths.\nexport function generateLoginToken(email) {\n return wixUsers.generateSessionToken(email)\n        .then((sessionToken) => {\n return { \"sessionToken\": sessionToken, \"approved\": true };\n        });\n} // End of Exported-Function 'generateLoginToken'\n-------------------- THIS IS BACKEND CODE (end) --------------------\n\n-------------------- THIS IS FRONTEND CODE (start) --------------------\n\n// Published 2019-09-23\n/// Make sure to check for new updates in Wix docs\n/// API-Reference: https://www.wix.com/corvid/reference \n/// Help-Center: https://support.wix.com/en/article/corvid-security-considerations (search from top-right bar)\n\n/// Place this on the login page (not the site but the page itself)\n\n\nimport wixWindow from 'wix-window';\nimport wixUsers from 'wix-users';\nimport wixLocation from 'wix-location';\nimport { generateLoginToken, getLoginToken } from 'backend/login.jsw';\n\n/*********************************\n * client-side login code *\n *********************************/\n\n /// This Gets Called upon the page's Log-in (when) being ready.\n /// This is IMPORTANT if you are using Member Area restricted pages and want to move to that page upon a login.\n wixUsers.onLogin( (user) => {\n let userId = user.id;           // EX) \"r5cme-6fem-485j-djre-4844c49\"\n let isLoggedIn = user.loggedIn; // should be 'true' here.\n let userRole = user.role;       // EX) \"Member\"\n console.log(`From ON-LOGIN. Here is User's Info: ID=='${userId}' && ROLE=='${userRole}'`);\n console.log(`From ON-LOGIN, Is User Logged-In? '${isLoggedIn}'`);\n wixLocation.to(\"/myWelcomePage\");  //Change the URL ending to whatever page you want to send the user to after they log in.\n console.log(\"From ON-LOGIN - Moving to New Page That is Member Restricted\");\n}); // End of Wix's Log-In Ready Function.\n\n\n/// This Gets Called upon the page loading to be ready\n$w.onReady(function() {\n\n/// Option-1 with both Email & Password.\n/// Showing 2 button examples although in reality should have 1 button for 1 login.\n/// This is tied to the button added in Wix-Web's UI, with the tag renamed to 'button01' -- Name it whatever (uniquely) you'd like.\n/// Personally I don't prefer this flow, due to security reasons, although based on your needs\n/// it maybe the only (Wix) available solution - e.g. 3rd party Auth.\n $w(\"#button01\").onClick((event) => {\n // Get current values\n let useEmail = String($w(\"#email\").value);\n let usePassword = String($w(\"#password\").value);\n // call backend function\n getLoginToken(useEmail, usePassword)\n    .then((loginResult) => {\n // if approved log the user in with the session token\n if (loginResult.approved) {\n wixUsers.applySessionToken(loginResult.sessionToken);\n console.log(\"Get-Token-User-Is-APPROVED.\");\n let isLoggedIn = wixUsers.currentUser.loggedIn // will be 'false' here.\n console.log(`From Get-Token, Is User Logged-In? '${isLoggedIn}'`);\n        }\n // if not approved log a message\n else {\n console.log(\"Get-Token-User-NOT-Approved.\");\n        }\n    });\n    }) // End of \"button01\" Click Action\n\n /// Option-2 with Email Only.\n /// Showing 2 button examples although in reality should have 1 button for 1 login.\n /// This is tied to the button added in Wix-Web's UI, with the tag renamed to 'button02' -- Name it whatever (uniquely) you'd like.\n $w(\"#button02\").onClick((event) => {\n // Get current value\n let useEmail = String($w(\"#email\").value);\n // call backend function\n generateLoginToken(useEmail)\n            .then((loginResult) => {\n // if approved log the user in with the session token\n if (loginResult.approved) {\n wixUsers.applySessionToken(loginResult.sessionToken);\n console.log(\"Generate-Token-User-Is-APPROVED.\");\n let isLoggedIn = wixUsers.currentUser.loggedIn // will be 'false' here.\n console.log(`From Generate-Token, Is User Logged-In? '${isLoggedIn}'`);\n                }\n // if not approved log a message\n else {\n console.log(\"Generate-Token-User-NOT-Approved.\");\n                }\n            });\n    }) // End of \"button02\" Click Action\n \n}) // End of Wix's Page Ready Function\n\n-------------------- THIS IS FRONTEND CODE (end) --------------------\nI hope this is helpful to someone ...\n","userEmail":"tu@gavitoj.ki","creationTime":1522156394159},{"id":"b5e954e7-0bd5-586e-b2b9-38a6860a0d08","title":"Online store","content":"can I create my own online store instead of wix app??\n","userEmail":"bi@anomil.gf","creationTime":1522177158927},{"id":"dd1a226c-9267-5246-a2c2-de4e377fd522","title":"How can I set the attributes for rich text for entire database column","content":"I would like to be able to set the rich text attributes, font and colour for every item in my large database so that it displays as desired on my page.  I do not wish to \"by hand\" change this in every cell in my database.\n\nDoes anyone have a solution for this?  This is all because you can't (as far as I know) just insert a simple character sequence to be interpreted as a break or a newline in a plain text field.\nIf this were possible, I would not need the thing I am requesting because I could utilize the font settings on the dynamic page for regular text.\n\n======\n\nSince my text is a set of paragraphs, I also do not want to use plain text because I have never found a solution to easily insert a break or newline into the a plain text field. \n\nHas anyone every come up with an easy solution that allows one to put rich text in the database and have it displayed on a dynamic page in a select font and colour without having to explicitly create this in the database each time.\n\nnote: changing field types from text to to rich text enables that bug which inserts a bunch of html into your text and forces you to go back and edit ... sheesh.\n\nEnquiring Minds","userEmail":"pugcaz@koocni.ai","creationTime":1531419337117},{"id":"c1794175-a826-5615-ba48-02432531e1b7","title":"Acceso a sección mediante códigos únicos que no se puedan compartir, éste cód lo recibe cada usuario al realizar el pago para acceder.","content":"","userEmail":"momoruc@jan.mu","creationTime":1529016678404},{"id":"677c93b1-324f-505a-949e-5606c5699937","title":"Access to section through unique passwords that cannot be shared, this password is received by each user when making the payment to access.","content":"","userEmail":"ijsup@fanre.vn","creationTime":1517615991702},{"id":"b5d1c78e-12cd-5e88-9550-b6137edc5978","title":"Access to section through unique passwords that cannot be shared, this password is received by each user when making the payment to access.","content":"","userEmail":"ah@etoaniera.sl","creationTime":1544665980158},{"id":"b0b894b1-b3e6-5918-8463-9a2549e14a02","title":"Conditional Strip","content":"I'm creating ~15 product detail pages using dynamic page feature in WiX. They have the same template where product title and description are fetched from the dB that I created.\nThe problem is a few of these products have videos which I can upload on YouTube/WiX. I can add video URLs to the dB against respective products. On the frontend, I want these videos to appear for products which have the video URL in the dB. For others, they should not appear.\nI was thinking if I can create a strip which is conditional which is displayed only if a value if found in the database.","userEmail":"ju@ju.sc","creationTime":1531388034703},{"id":"e75e6066-50cf-539d-bb75-a26f913ea84d","title":"Creating a Show-More button for a text","content":"Hello everyone, I am working on my website homepage descriptions (https://www.giacomoguaragna.comand) but I am having some troubles with the code of a show more text. What I want to have is a text which can be expanded if you click on a button below (or simply by hover the mouse on it).\nI followed the tutorial in this link https://support.wix.com/en/article/wix-code-tutorial-creating-a-show-more-link#working-with-dynamic-text but I don't understand why it is not working...\nHere some images and the code I am using:\n\n \n\n \nThe problems are 2: when I preview my page, the text \"I would like to start my story by...\" is completely shown (even if only the first 40 characters should be visible) and when I click on the \"Show more\" button nothing happens. In the editor view, the platform doesn't signal me any errors, whereas when I preview it, it shows me 2 errors...I also tried to publish it but nothing changes as well. \n\n \n\nHere the code (copied from the tutorial):\n\nlet fullText; // variable to hold the full text\nlet shortText; // variable to hold the short version of the text\n\n// how many characters to include in the shortened version\nconst shortTextLength = 40;\n// read the full text and store it in the fullText variable\nfullText = $w(\"#text70\").text;\n// grab the number of characters defined in shortTextLength and store them in the shortText variable\nshortText = fullText.substr(0, shortTextLength) + \"...\";\n// set the contents of the text element to be the short text\n$w(\"#text70\").text = shortText;\n\nexport function button1_click(event) {\n //Add your code for this event here: \n$w(\"#text70\").text = fullText;\n// collapse the button\n$w(\"#button1\").collapse();\n}\n\n \nI am very new to coding and this is not the first time I struggle with WIX. Of course, I am also open to other ways to reach my objective here.\nIf anyone could help me, I would be very grateful!\n\nThanks,\nGiacomo\n","userEmail":"ba@rube.pr","creationTime":1544922672103},{"id":"8d68ce18-329e-52ba-824f-8b69f135d672","title":"Help! login and signup just stopped working","content":"Can anyone please help me out here.\n\nMy website was working absolutely fine up until a few days ago.\n\nNow people can not login , click forgot password or submit registration request.\n\nHere is my code for the lightbox, I have checked all of the object names to ensure they match.\n\nIt appears that wherever Wix-Users is involved it just has stopped working.\n\nIs anyone else having this issue? as im at the end of my tether with this. i could revert to the Wix standard login however i dont feel it is fit for a customer facing website.\n\nI contacted Wix support who claim i need to include the members data set in my page and link each individual item to the data set, however i believe this to be incorrect as there is no forgot password in the data set, nor is there a password field to link.\n\nAlso if you do try to link an email - you cannot type into the box\n\n\nI have tried reverting to my last release over over 3 weeks ago, still didnt work. I have copied my exisitng light boxes as this seemed to fix a bug that was present last month, this also didnt work\n\n\n \n\nimport wixUsers from 'wix-users';\nimport wixLocation from 'wix-location';\nimport wixWindow from 'wix-window';\n\n$w.onReady(function (){\n    $w(\"#forgottenPassword\").onClick(\n        (event) => {\n //WixWindow.lightbox.close//wixWindow.lightbox.close()\n\n            wixUsers.promptForgotPassword()\n            .then( ( ) =>{\n //\n            })\n            .catch((err) => {\n let errorMsg = err; //\"The user closed the forgot password dialog\"\n            });\n        });\n    });\n \n$w.onReady(function(){  \n    $w('#loginNow').onClick(function (){    \n let email = $w('#loginEmail').value;    \n let password = $w('#loginPassword').value;  \n        wixUsers.login(email,password)  \n        .then(()=>{\n            wixLocation.to('/HOME');   \n            })\n            .catch((err) => {\n            console.log(err);\n\n        $w(\"#passwordWrong\").expand();\n            });\n        })\n    })\n\n\n\n \n\nHere is the code for my registration \n\n \n\nimport wixUsers from 'wix-users';\nimport wixLocation from 'wix-location';\n \n$w.onReady(function(){  \n    $w('#registerNow').onClick(function (){  \nlet email = $w('#email').value;\nlet companyName = $w('#companyName').value;  // the user's company name\nlet password = $w('#password').value;  // the user's password\nlet firstName = $w('#firstName').value;  // the user's first name\nlet lastName = $w('#lastName').value; // the user's last name\n\nwixUsers.register(email, password, {\n    contactInfo: {\n \"firstName\": firstName,\n \"lastName\": lastName,\n \"companyName\": companyName,\n    }\n  })\n  .then( (result) => {\n let status = result.status;\n let approvalToken = result.approvalToken; // \"Pending\"\n let user = result.user;\n      wixLocation.to('/exit'); \n            })\n        })\n    })\n\n\n\n","userEmail":"hos@riwo.sj","creationTime":1535432699259},{"id":"bded4175-a519-5dee-abed-014e7242e6f0","title":"Can't seem to pull url or mailto:","content":"Hi, I need a little help. I've been researching and changing the code tons of times, trying to resolve this issue.\n\nSeems like I'm a step closer, but couldn't pull their email address from the database. I have a repeater with database linked. \n\nimport {local} from 'wix-storage';\nimport wixData from 'wix-data';\nimport wixLocation from 'wix-location';\n  \n  \nexport function email2_click(event) {\n    wixData.query('staffdirectory')\n \n let email = $w(\"#email2\").link;   \n\n        $w(\"#email2\").onClick(eMail => {\n const subject = \"WEBMAIL\";  \n             wixLocation.to(`mailto:${email}?subject=` +         \n                encodeURIComponent(subject)    \n             ); \n        })\n\n  }\n\n \n","userEmail":"tuhodnam@vuata.bb","creationTime":1515257229186},{"id":"f8690eb5-fdc0-5a62-b84b-14abdac3e33f","title":"Dropdown input on dynamic page with backend query","content":"Hi,\n\nI was wondering if someone would be able to point me in the direction of why I can't get the below code to filter with the dropdowns?\n\nI have been trying to improve the sites speed and responsiveness and have been trying to use the backend for multiple queries.\n\nNote: pageTitle is the field key for the grades.\n\nBack end\nimport wixData from 'wix-data';\nimport wixUsersBackend from 'wix-users-backend';\n\nexport function getSearch(field, test) {\n let query = wixData.query(\"Courses\");\n if(test.length > 0) {\n        query = query.contains(field, test);\n    }\n return query.find();\n}\nFront end\n \nimport {getSearch} from 'backend/utilitiesModule';\n\nexport function searchButton_click(event) {\n//$w('#regionDropdown').value = \"all\";  \nlet categoryValue = $w('#dynamicDataset').getCurrentItem().title;\nlet gradeValue = $w('#gradeDropdown').value;\nlet regionValue = $w('#regionDropdown').value;\n    console.log(regionValue)\n    console.log(gradeValue)\n    console.log(categoryValue)\n    getSearch(\"coursesCategory\", categoryValue && \"pageTitle\", gradeValue ).then(function (resp) {\n let items = resp.items;\n let courses = [];\n        items.forEach(function (item) {\n let course = { \"coursesCategory\": item.coursesCategory, \"rating\": item.rating, \"_id\": item._id, \"title\": item.title, \"image\": item.image, \"duration\": item.duration, \"individaulPrice\": item.individaulPrice, \"lightbox\": item.lightbox, \"prices\": item.prices, \"description\": item.description, \"count\": item.count };\n            courses.push(course);\n        });\n        $w('#repeater1').scrollTo();\n        $w(\"#repeater1\").data = []; \n        $w(\"#repeater1\").data = courses; \n    });\n    $w(\"#gradeDropdownTwo\").value = $w('#gradeDropdown').value;\n    $w(\"#regionDropdownTwo\").value = $w('#regionDropdown').value;\n\n}\nI have working code \ngetSearch(\"pageTitle\", gradeValue ).then\nbut on the dynamic page all of the grades for all trips show not just what is relevant to the current page i.e. rock climbing it would show every trip from hiking, holidays, canoeing etc\nso I tried this line but it doesn't seem to work but no errors. \ngetSearch(\"coursesCategory\", categoryValue && \"pageTitle\", gradeValue ).then\nIn the end, I'm looking to combine two dropdowns, grade and region and the relevant trip category to display the appropriate trips on the dynamic page.\n\nThank you!","userEmail":"defofu@upbuk.com","creationTime":1530023138742},{"id":"371cc0a8-9e14-5c68-bbec-fecf771515bc","title":"Repetidor duplicando conteúdo em página dinâmica","content":"Estou utilizando a página dinâmica em um site e, apesar do meu banco de dados não conter nenhum dado repetido, ao publicar e visualizar meu site, o conteúdo se repete. \nAlguma ideia de como resolver esse problema?\n\nI'm using the dynamic pages on my website and although the content on the database is not duplicated, once i save the page and visualize it, the list of content repeats itself twice. Does anyone know what could be causing this problem?","userEmail":"uwu@coiko.ph","creationTime":1542636109622},{"id":"5c65c02f-d314-5628-90cc-e44524da0e61","title":"Please help  Forms and Database question","content":"I have been reading the forum but it is like I am in another world I don't understand. I have a mental health site with members being therapists.   With in their member pages I need a form to input all of their info that will be displayed on the site to the public.  \nHowever when I create the form the user needs to be able to update it as needed live into the data base and not create duplicate entries. I thought this may be solved by making the content read and write but when I did this the form would not allow input data even though the member had permission to update their own data.  I also need that data to save and display on that form so they can see what is already entered and update on fields that they want to change such as location etc.  I see people posting code but when I go to pull up the at the bottom it does not show any code and I suck at deciphering code anyway is there an easy fix to this a setting I can check or click to make the data stay in the form and only update.  I have read some stuff about duplicates but it appeared as if I would have to write code and a new entry database for submissions for each field and the form has a Lot of fields. Plus I am running out time and am on a strict deadline any help would be great. \n","userEmail":"kireknim@eniogorak.nr","creationTime":1537125764773},{"id":"fd97223c-be26-5e2e-bd38-d24ac5ac8418","title":"Changing Text Color Inside Button ","content":"Hello! I know this has probably been asked a million times, but I haven't been able to find a specific answer. I'm trying to change the text color inside of a button using MouseIn and MouseOut because the \"customize design\" options do not seem to be working. I need button options for my design because I'm programing custom hover features connected to them. In wanting to change the text color on hover, am I trying to do something that can only be done using html? If so, how can I switch over to change the text color inside of the button. Thank you in advance for any  help on this! Here's what I'm working with: \n\nexport function RiskHover_mouseIn(event) {\n //Add your code for this event here: \n    $w('#riskstrip').show(\"FadeIn\");\n    $w('#coverstrip').show();\n    $w(\"#riskbutton\").style.color=\"rgb(255,69,0)\"\n}\n\nexport function RiskHover_mouseOut(event) {\n //Add your code for this event here: \n    $w('#riskstrip').hide();\n    $w('#riskbutton').style.color = \"rgb(255,255,255)\";","userEmail":"rafwal@piki.gg","creationTime":1523237070380},{"id":"6e37937d-cb3c-5325-baa3-00fbdf0f2cdb","title":"Wix code SDK Warning: The text parameter cannot be set to null or undefined","content":"Hi everybody!\nFirst of all, thank you so much for taking the time to read this!\n \n\nWhat I am trying to do: code my lightbox so that the users can check what are our delivery prices and times in their country. There is one collection called \"Lieferkosten\", that combines this information in 4 columns/fields:  Country (land), Region (region), Delivery fee (versandkosten) and Delivery time (versanddauer). The names in brackets are the respective fieldkeys.\nUnder the two dropdowns where users can select their region and country, there are 3 textboxes that should display: #text55 (selected country name), #text56 (the delivery fee that corresponds to the selected country), #text57 (the delivery time that corresponds to the selected country)\n\nWhat works so far: The client clicks on the #dropdown2 to select what region he comes from. Upon user input (selection of a region) an On Change function causes the #dropdown1 to be activated and display all the countries that belong to this selected region. The country name selected on #dropdown1 is shown on textbox #text55 (however not thanks to code but to the API connection)\n\nProblem:\n#text56 and #text57 either display nothing or remain unchanged.\n\nI have tried several solutions, checked the fieldkeys many times and they do correspond to what is in the collection. On my latest attempt (which is the code below, where I only tested it on #text56) I get the error message:  \"Wix code SDK Warning: The text parameter of \"text56\" that is passed to the text method cannot be set to null or undefined.\" and on the developer tool I find: \"TypeError: Cannot read property 'versandkosten' of undefined\"\n\n...\nexport function dropdown2_change(event) {\n    uniqueDropDown2();\n$w(\"#dropdown1\").enable();\n    NewQuery();\n$w('#text56').text = NewQuery()\n\n}\nfunction NewQuery() {\n let myTextQuery = $w('#dropdown2').value\n   wixData.query(\"Lieferkosten\").eq(\"versandkosten\", myTextQuery) // the first element here is the field key, not the field name.\n.find()\n.then((results) => {\n if(results.items.length > 0) {\n let item = results.items[0];\n let secondText = item.versandkosten; //the field key of the second column\n let thirdText = item.versanddauer; //the field key of the third column\n    }else{\n //put here the code you want to execute in case of no match.\n    }\n})}\n\n \n\n \n\nI´m very new to corvid and don´t know that much about coding so would really appreciate any corrections or tips even if they are an entirely new suggestion of code :)","userEmail":"lugcuge@ojta.eh","creationTime":1544677970688},{"id":"5380103c-256f-56af-84e2-65ce997bf8f1","title":"repeater with text box with link","content":"I have a repeater connected up to a data collection. Within that repeater I have a text box. I would like to be able to click on it and cause a tab to open with some url based on some field in the data collection. \n\nI have tired : \n1) to use a button - works fine but limits the text to 1 line. \n2) to add the following code :\n\n \n* ignore the populate drop down.\nThis opens the url in the same window. Unfortunatly I could not work with the standard js window.open(<url>).\n\nThanks in advance :)","userEmail":"lisuc@guku.eu","creationTime":1530635262541},{"id":"d8a5917f-87b2-5cc6-8d00-8ecdeb9b6c0d","title":"lightboxes connect to photos in dataset","content":"Hi, I need help with dataset.\nsituation: i have a list of emplyees with photo, name, position and contacts. It is made with repeater connected to dataset. I would like to show lightbox with closer info about person after click on photo in list. \n\nI tried to make it by reach text and connect it to tooltip but it isnt possible connect rich text field to tooltip. than i tried to connect it by link but i cant insert link to lightbox and if i connected it to pohoto on repeater it show on live site same lightbox after clicking on all photos. \n\nI hope you understand what is my issue and somebody help me. \n(i am not programmer just amateur)\nTHX","userEmail":"coihku@bokezawi.bv","creationTime":1533629598852},{"id":"a11e9d96-1fe1-598a-89e4-1df3e42fbc8d","title":"Submit stores wrong user input field in database","content":"I created a form which, among other things, stores a text value in a user input box (read-only) when a button is clicked running the code  $w('#inpAllDayDeal').value = \"48\";. The initial value of the box has been set to \"none\" and \"10\" in my testing. It all works fine, except when SUBMITted, the the database field contains the initial value, not \"48\".  I've tried unchecking read-only, but the only thing that works is if I input the value manually.","userEmail":"valvib@age.gl","creationTime":1519688893697},{"id":"3caf346c-8ed4-5376-89c9-40f927a0763d","title":"Create a button with multiple lines of text.","content":"This text is copy of  Guillaume Noel but I think there is a lot of us who need it:\n\nSome of my buttons have a lot of text (8-10 words) and it's fine on the computer side because I can just make a longer button but when I get to the phone version, I cannot fit all the text of my buttons on 1 line unless I make it ridiculously small. \nHaving the possibility to make a button with multiple lines of text would fix my problem and also bring the possibility of square or circle buttons with 2 words one of top of each other like \"click here\" or \"buy now\" as an example.\n\nThanks for any advice :)\n ","userEmail":"gellawid@odese.pk","creationTime":1522879308573},{"id":"d26318a2-170b-5995-ab86-8e2a8bc1870b","title":"hi everyone, tell me how to add a FILE SHARE to a separate page","content":"","userEmail":"davfi@alkesu.ne","creationTime":1530004517968},{"id":"211dc1e5-91f6-52b4-97cf-9f8ebbe30f52","title":"C2C eCommerce","content":"Hey,\n\nI want to create a community platform(website) in which people can create their own profile and upload objects they would like to loan other people - such as loaning a screwdriver for 5$ a day. And then other people who would like to borrow could contact them and maybe pay via the website.\n\nIs it possible to create a website like this with \ndose Wix have the right features for it?\n\nthanks ahead (:\nDafna","userEmail":"pugnut@oj.az","creationTime":1522204792338},{"id":"7a808826-1820-56f3-9523-380a28fdeac4","title":"Deleting sandbox entries doesn't propagate to Live","content":"When I delete row entries in my sandbox, the corresponding entry in the live database is not deleted.\n\nFirstly, is there a way to delete a set of rows in the sandbox?  Rather than one at a time in the editor?\n\nAnd how do I make this consistent with the live database.   I don't want to have to delete 2 sets of entries just to eliminate one item.   \n\n","userEmail":"pam@rasabun.cu","creationTime":1534514104279},{"id":"f7afa228-9db8-50e3-91ad-3ad9c3c81688","title":"Custom Code/Can I Put PHP Here?","content":"I understand I cannot put php in corvid code. I am guessing I may be able to put some php code in this unusual spot. Can someone verify this is true before I waste a bunch if time trying this?\n\nI need to talk to a 3rd party back end and have some rock-solid php code that is already written and tested.\n\n \n\nThis seems like an odd place (accessed via Settings >> Analytics. But it seems I can put non-native corvid code in a custom spot if I go that route. Anyone know?\n","userEmail":"rusha@eguoci.eg","creationTime":1524595561505},{"id":"26daf1d3-1f27-586c-8d73-abff929b1eee","title":"Collection import replace","content":"I have a collection that I will be importing data from a CSV file. This CSV file is generated from a local database application and is updated on the local system 2 times a month, which we then generate a new CSV file.\n\nThe CSV file (approximately 900 rows, but the total changes each time) imports as expected into the Collection. But, the imported rows are added to the current Collection. And if we sync the data to the live Collection, the data is added to that Collection as well.\n\nSo, for example, if we have a sandbox collection of 900 rows, importing a new CSV file results in 1800 rows and so forth and so on.\n\nWe need the imported CSV file to completely replace the current database contents during import and when syncing to the live collection (even if the imported CSV file has fewer rows). Or as an option, at least be able to easily completely empty a collection before importing a new CSV file.\n\nThanks for any suggestions offered.\n","userEmail":"tah@akisa.so","creationTime":1521441785420},{"id":"d8b4abc7-2952-5302-9230-d0da78a42105","title":"Corvid Tutorial: Creating a Show-More Link","content":"\nHi everyone,\n\nI was wondering if anyone could help me with this?\n\nI have followed the tutorial to set up a collapsable section of text with the read more read less functionality. The text is now not showing on my published site at all. I can't see any issues and wondered if anyone could have a quick look over it for me? The code I used from the Corvid tutorial is below and my site is https://www.businessnetwork.healthygirlhq.com\n\nThanks so much in advance to anyone that can help \n\nRacheal \n\n$w.onReady(function () {\nlet fullText; // variable to hold the full text\nlet shortText; // variable to hold the short version of the text\n// how many characters to include in the shortened version\nconst shortTextLength = 40;\n// read the full text and store it in the fullText variable\nfullText = $w(\"#text5\").text;\n// grab the number of characters defined in shortTextLength and store them in the shortText variable\nshortText = fullText.substr(0, shortTextLength) + \"...\";\n// set the contents of the text element to be the short text\n$w(\"#text5\").text = shortText;\n});\nexport function button5_click(event) {\n// check the contents of the text element \nif ($w(\"#text5\").text === shortText) {\n// if currently displaying short text, display the full text\n$w(\"#text5\").text = fullText;\n$w(\"#button5\").label = \"Show less\"; \n} else {\n// if currently displaying full text, display the short text\n$w(\"#text5\").text = shortText;\n$w(\"#button5\").label = \"Show more\";\n}\n}","userEmail":"cadge@un.lb","creationTime":1526491512242},{"id":"3e738541-095d-55bd-97f5-e432a95e0df6","title":"async function with a foreach loop","content":" Hi guys! \n \n I am getting better but still running into some dead ends with my coding :) \nThis is what I am trying to do:\nI have crated a time-table matrix as collection: Gruppenkalender (see pic1). \n\n \n\nThe idea is that whenever I open the time-table site, the time-table-collection will be cleared, then filled with data from a query function and then finally populates the table on the site.  \n\n \n\n  \nThe code works. I guess it could be a bit more elegant but ok… 😊\nThe problem is, that I am running into a time-out:\nWhen the site loads, I am getting maybe 2 of 15 entries. \nWhen I click button10/Neu it executes the function again and I am getting more and more results.  \nI changed now from a async/await to a .then function but didn’t change much. \n\n Button11/Refresh does refresh the dataset connected to the table and is not changing anything. So I guess it’s the function.\n\nFrontend:\n\nimport wixData from 'wix-data'; \nimport {GruppenKalenderReset} from 'backend/Gruppenkalender'; \nimport {GruppenKalenderAktuell} from 'backend/Gruppenkalender';  \n\n$w.onReady(async function () { \n$w('#repeater5').expand() \nGruppenKalenderReset().then(() => { \nGruppenKalenderAktuell().then(() => { \n$w('#dataset1').refresh() })}) $w('#dataset1').setFilter(wixData.filter().contains(\"title\", \"Montag\"))  });  \n\nexport function dropdown1_change(event) { \nconst filterValue = $w(\"#dropdown1\").value $w('#dataset1').setFilter(wixData.filter().contains(\"title\", filterValue)) }  \n\nexport async function button9_click(event) {     \nGruppenKalenderReset() .then(() => {     \n$w('#dataset1').refresh()}) }  \n\nexport async function button10_click(event) {     GruppenKalenderAktuell().then(() => {         \n$w('#dataset1').refresh()}) }  \n\nexport function button11_click(event) {     \n$w('#dataset1').refresh() } \nBackEnd:\n\nimport wixData from \"wix-data\";\n\nexport function GruppenKalenderReset() { \nreturn wixData.query(\"Gruppenkalender\")         \n .limit(500)         \n .find()         \n .then((results) => {             \nresults.items.forEach((item) => {                 \n item.lyra = null                 \n item.balo = null                 \n item.omego = null                 \n item.amadeo = null                 \n item.pablo = null                 \n item.tymo = null                 \n item.diego = null                 \n item.myro = null \nreturn wixData.update(\"Gruppenkalender\", item)             \n});          \n}) } \n \n \n\n\nexport function GruppenKalenderAktuell() { \nlet GruppentrainingP = \"b188f84c-bf81-4ab6-86bd-da071f430bf3\"     wixData.query(\"AktuellerBetreuer\")         \n .limit(200)         \n .ge('ende', (new Date()))         \n .eq(\"produkt\", GruppentrainingP)         \n .or(             \n   wixData.query(\"AktuellerBetreuer\")                  \n   .isEmpty('ende')             \n   .eq(\"produkt\", GruppentrainingP)         ) \n .find() // Run the query         \n.then(res => {             \nres.items.forEach((itemBT) => {  \n\nwixData.query(\"Gruppentraining\")                     \n.limit(500)                     \n.include(\"gerate\")                     \n.eq(\"aktuellerBetreuer\", itemBT._id)                     \n.find()                     \n.then((results) => {                         \nresults.items.forEach((item) => { \n\nlet TimeSplitter = item.anfang.split(\":\");  \nlet hour = (TimeSplitter[0]);  \nlet Minutes = (TimeSplitter[1]);  \nlet Time = hour.padStart(2, '0') + \":\" + Minutes.padStart(2, '0')  \nlet Geraet = item.gerate.title.toLowerCase()  \n\nwixData.query(\"Gruppenkalender\")                                 \n.limit(1)                                 \n.eq(\"title\", item.title)                                 \n.eq(\"anfang\", Time) \n.find()                                 \n.then((results2) => { \n let data = results2.items[0]  //console  //  let data = results2.  \n if (Geraet === \"lyra\") { data.lyra = item.kunde }  \n if (Geraet === \"balo\") { data.balo = item.kunde }  \n if (Geraet === \"omego\") { data.omego = item.kunde }  \n if (Geraet === \"amadeo\") { data.amadeo = item.kunde }  \n if (Geraet === \"pablo\") { data.pablo = item.kunde }  \n if (Geraet === \"tymo\") { data.tymo = item.kunde }  \n if (Geraet === \"diego\") { data.diego = item.kunde }  \n if (Geraet === \"myro\") { data.myro = item.kunde }  //console.log(data) \n  wixData.update(\"Gruppenkalender\", data)                                         .then((results3) => {  \n let item3 = results3; //see item below                                                                                     \n  })                                         \n .catch((err) => {  let errorMsg = err;                                         });                                 \n  })                         \n })                     \n  })             \n })         \n  }) } \n\n        \n\n \n                                   \n\n\nAny idea how I get this baby workin and more solid?\n\n\n","userEmail":"un@atucopud.es","creationTime":1542003362796},{"id":"2baec6f8-9cde-5b7f-b8ba-697bfe7f0b9b","title":"Display column images in gallery","content":" I have 4 image columns per item(row) and filtered data set with item id. I'd like to show them in gallery. Is it possible without coding ? I think gallery can only show row data. If coding required, can I have some samples ? thanks.","userEmail":"cojza@orivibu.bh","creationTime":1519103713518},{"id":"6b6dde63-e310-5c33-8c93-ae3172a4f5f2","title":"Dear Wix,","content":"I have been trying to filter search my website, but for some reason my search result is blank as follows:\n \nAnd this is my code\n\n \nPlease kindly advise what I do wrong.\nThank you in advance\n\nBest,\nZP","userEmail":"uvoruom@bej.ni","creationTime":1542526396191},{"id":"abea7b00-f147-54d1-88b6-60a91222531b","title":"Connect existing Image Gallery to database","content":"Hi, I have an existing static page with an image gallery with lots of images. I'd like to store the gallery with all the images in the database. How can I do that?\nJust to explain further I am converting a number of pages with image galleries to one dynamic page. ","userEmail":"cit@zom.li","creationTime":1540918838122},{"id":"8fa89ee0-3389-5cf1-8008-95db578f6e53","title":"Date difference from database","content":"I would like to get the difference in _createdDate and _updatedDate . This value should be multiplied by 10. Any help, full code will be appreciated.\n \n","userEmail":"razuse@vouzusud.tg","creationTime":1540027253261},{"id":"d1b3026b-c34c-5287-a9b3-edb5aaef91d6","title":"Basic Questions about Software Integration","content":"Good day :)\n\nI am having an auction/marketplace website developed for myself and WixCode was released at the same time so I am wondering if it is possible to do this in Wix.  \n\nThis is the software I purchased:  http://ecommercemix.com/  - I also have hired a developer team.  \n\nMy questions are:\nCould we use the software above with Wix?  Or could we develop a custom auction platform in Wix at this point?  \n\nAny thoughts suggestions or tips?  \n\nThank you/Sarah","userEmail":"muvo@fuhjuc.bo","creationTime":1539316082816},{"id":"b7151edd-06bf-5a26-b338-60bf851661ae","title":"Help I am a beginner in javascript!","content":"Hi i need help please! i'm a beginner at java script. i'm trying to use an onlick event to change the color of a button in my code, this button links to and other HTML file. Here is the HTML and CSS code.\n\n\nHTML code:\n\n<a  href=\"index.html\"><button  class=\"btn-hm\">HOME</button></a> \n\n<a href=\"Photogallery.html\"><button class=\"btn-gp\">Photo Gallery</button></a>\n\n\nCSS code: \n\n.btn-hm{\n\nfont-family: 'Mansalva', cursive;\ncolor:white;\ntext-shadow: -2px 0 black, 0 2px black, 2px 0 black, 0 -2px black;\nborder: 4px solid white;\npadding:10px 22px;\nfont-size: 35px;\nborder-radius: 10%;\nbackground-color:gray;\ncursor: pointer;\ncursor: hand;   \n\n}\n\n.btn-gp{\n  padding:10px 22px;\n  font-size: 35px;\n border-radius: 10%;\n  font-family: 'Mansalva', cursive;\n  border: 4px solid white;\n  color: white;\ntext-shadow: -2px 0 black, 0 2px black, 2px 0 black, 0 -2px black;\nbackground-color:gray;\ncursor: pointer;\n    cursor: hand;\n  }\n\nI've tried a few things in JS and it fail every time. please someone help me and explain what i need to doe  :(","userEmail":"wogel@foter.bn","creationTime":1545625643857},{"id":"a18f9ec1-cc1d-5f58-ae85-e2c3cee90b27","title":"How did you make your website on a budget? Would wix work? I am an artist\n","content":"So I am an artist and have 0 experience with websites at all. I am running on a limited budget and haven't made much money yet, but my gallery (and I guess me to some extent) is ranked in the top 10 in my big city (semi large state capital). I need to expand now and get a website, I am not going to sell any art off there as I am trying to stay high brow ish and am only selling at galleries and auctions, I just want to explain my art (it is very... unique) and provide images. Would six work for this? I'm just looking to show people what I am about and give a link on trip advisor as well as gove critics somewhere to look and contact me. My budget is like 300 (enough to use six but probably not a real designer) so what do you guys think https://cnv.to/","userEmail":"fusom@ireruveho.er","creationTime":1517624146865},{"id":"9581d77e-edec-57d7-8626-72b57fa6037f","title":"Repeaters performance on a dynamic page","content":"Are 15 repeaters (each with 5 items) gonna be too much for a dynamic page to handle?\n\nEach item container will have a button, a text element and 3 pictures of 5 KBs each.\n\nWill this break the page?\n\nThoughts?","userEmail":"kapgip@ite.fo","creationTime":1525545421561},{"id":"264a85a8-907d-51c5-9647-d25fa4b8f077","title":"Calendar","content":"Has anyone found any good solutions with integrating calendar bookings with Wix Code? I am looking for basic functionality such as the option to book dates, displaying availability and an add to calendar function. ","userEmail":"kiujuma@ul.ua","creationTime":1529188631674},{"id":"426594ab-f798-525a-8744-e13dad736837","title":"Guide for Google reCAPTCHA v3\n","content":" General Settings To get the access to the Google reCAPTCHA v3 settings please go to System → Configuration → Sales → Google API and expand the Google ReCaptcha section. \nEnable — Enables module Site Key — fill in an individual site key generated for your store Secret Key — fill in an individual secret key generated for your storeHow to generate Site Keys and Secret Keys — To get a Site key and a Secret key click here. \n1. Set the label; \n2. Select the needed type of Captcha ( reCAPTCHA v3 for Checkbox Type of Captcha); \n3. Define the domain of your website; \n4. Tick the Terms of use checkbox; \n5. Press the Submit button. \nCopy the keys from this page: Go back to the backend of the module. Paste the Site key and the Secret key Forms — Pick the forms that need to be protected by Captcha via multi-select control. Custom Forms — Comma separated \n\nhttps://docsbay.net/guide-for-google-recaptcha-v3","userEmail":"dame@fuvcopug.bz","creationTime":1517148137111},{"id":"93459bb4-eeba-5fb2-be68-91515c985b52","title":"Job scheduler - Not working","content":"I have a Job scheduler which I can not get to work:\n\nMy jobs.config :\n// /backend/jobs.config\n{\n \"jobs\": [\n    {\n       \"functionLocation\": \"/timer.check\",\n       \"description\": \"Check for events\",\n       \"executionConfig\": {\n         \"time\": \"13:52\", // mandatory, “hh:mm” format\n      }\n    },\n    {\n     \"functionLocation\": \"/timer.check\",\n     \"description\": \"Check for events 2\",\n     \"executionConfig\": {\n       \"time\": \"15:52\", // mandatory, “hh:mm” format\n      }\n    },\n    }\n  ]\n}\nMy function located in timer.js in the backend:\nexport function check () {\n    console.log(\"Checking for new events\")\n    clearInterval(interval)\n    let interval = setInterval(() => {\n        console.log(\"Checking for new events\")\n    },2000)\n}\nI am living in UTC + 2 and therefore made sure to subtract 2 hours from my current time to enter the correct time in UTC in the jobs.config.\n\n","userEmail":"wizo@uha.kn","creationTime":1539154698723},{"id":"7a03b846-f2ff-54a2-86b3-911f524f55c5","title":"Remove or replace event listeners.","content":"Hello. I've created a wrapper for `$w` that disables adding of multiple event listeners to element, so for example, every new onClick will rewrite previous one, instead of adding new. (wraps all methods where name starts with 'on'). This way you can delete or replace event listeners.\n\nhttps://github.com/skorokhod-andrii/wix-event-wrapper\n\nLet me know if you find any bugs. Pull requests are welcome.","userEmail":"petzole@lewes.mr","creationTime":1536055279676},{"id":"b1229a5b-7230-5142-86ba-cc1da320641e","title":"WixPay How to collect shipping address information","content":"Hello this is my first forum post, so let me know if I can do anything differently in the future!\n\n\nI have a sock subscription website which sells socks every month.  In order to customize the Wix PaidPlans landing page, I have to code the page using the WixPay API.\n\nEverything works fine, even the payment goes through.  The only problem is that the  \nwixPay.startPayment function does not prompt/return a shipping address.  So I don't know where to ship the goods.  The frustrating part is that if you use the regular Wix Store, the checkout page requires both the billing and shipping addresses.  As far as I can tell, there is no way to modify the lightbox that appears in order to collect more information.\n\nPlease let me know if there is indeed a way to import shipping info from the customers using WixPay.\n\nA picture of the WixPay payment collection lightbox:\n\n\n \n\nHere is the code I am using.  Again, it works, but I just need to add the extra shipping address.\n\n\nPage Code:\n\n\n\n$w.onReady(function () {\n\n const currentPlanObject = $w(\"#dynamicDataset\").getCurrentItem();\n const planId = currentPlanObject._id;\n const planPrice = currentPlanObject.price;\n\n  $w('#button1').onClick((event) => {\n\n let user = wixUsers.currentUser;\n let isLoggedIn = user.loggedIn;\n if (!isLoggedIn) {\n      wixUsers.promptLogin().then(() => {\n        processPlan(planId, planPrice);\n      })\n    } else {\n      processPlan(planId, planPrice);\n    }\n });\n});\n\nfunction processPlan(myId) {\n\n \n    wixPaidPlans.purchasePlan(myId).then(orderObject => {\n      wixWindow.openLightbox(\"Contact\", orderObject)\n       .then((goForIt) => {\n if (goForIt) {\n         wixPay.startPayment(orderObject.wixPayOrderId);\n       }\n      });\n    })\n \n}\n \n\n\nBackend code:\n\n\n \nimport wixData from 'wix-data';\n\nexport function wixPaidPlans_onPlanPurchased(event) {\n\n // Insert a title reflecting the type of transaction, and\n // the event's order object (json) into \n // the collection's data field.\n if (event.order.price.amount === 0) {\n let orderData = {\n \"title\": \"Free plan purchased\",\n \"data\": event.order\n        };\n        wixData.insert(\"planEvents\", orderData);\n    } else {\n let orderData = {\n \"title\": \"Regular plan purchased\",\n \"data\": event.order\n        };\n        wixData.insert(\"planEvents\", orderData);\n    }\n}\n\n\n\nLink to how it would look.  This is a product page, not a subscription page, but the problem is the same:\n https://reexlmain.wixsite.com/nysc/stores/products \n\n","userEmail":"guc@cugiton.td","creationTime":1525458376891},{"id":"caa8eff8-bca6-5e9e-abef-9fb97d30bb91","title":"Help with setFieldValue","content":"I have a item dynamic page where I made a form.\nI'll hide one of the fields and it must contain the same text of #text6 before save the form.\n\nI'm really bad in JavaScript and have no clue where is the mistake.\n\nThe code is:\n \nexport function button1_click(event, $w)\n {      \n        $w(\"#dataset1\").setFieldValue(\"codMold\", $w('#text6'));\n \n}\n\n\nBut the content of the field comes [object Object]\n\nI know probaly it's a dumb mistake, but I've tried everything i know =(\n\nI 'll really apreciate if some one help =)\n","userEmail":"cines@womco.pa","creationTime":1518048320319},{"id":"c6d0f8f3-aee2-5d0b-bbe1-5b86a3c86667","title":"'Dropdown List' with options that can link to pages.","content":"Looking for a bit of help creating an interactive dropdown list. \nTo avoid confusion, I'm not looking for a Menu Navigation Bar dropdown it has to be separate. \nIf this has already been asked, please point me in the right direction. \n\n \n \nI'm trying to create a dropdown list on my home page that links to other pages. \n- It needs 6 options (pages) inside of it.\n- These will then link to their own category pages. (see picture below)  \n\n \nWhen you click one of those options, I would like it to link to the page it relates to.\n\ni.e Adventure in the dropdown will link to the Adventure Tour page. \n\n\nHow did I get the dropdown? \nI turned on the Developer options and grabbed a dropdown box from the user input section. \nTo my understanding these dropdowns are usually for forms, but i've heard that they can be used for what I'm trying to do here. \n\nCurrently, I only have the design setup (pictured above) and you can click the items. But none of those items are linked to anything, as I don't know how to link them to a page or IF that's even possible. \n\nIs there some coding I can do to get this working? \nOr another option of a dropdown list/menu that I could work with?\n\n \n\nI appreciate any help on this, I've been staring at it for hours without any results.\n\n:)","userEmail":"ru@fabuni.pt","creationTime":1520573428980},{"id":"6aa0a75c-32f0-522b-bbe6-807c51ada4b7","title":"Adjusting website content to the size of the ​screen its being viewed on","content":"Hello!\nI have been using wix to host my website for the last 3 years and a complete revamp is underway. – The editing has predomenantly been done on my 13\" laptop, but decided to shift over to my 23\" editing screen to realise that the content is tiny compared to the size of the window. \nIs there any function or code I can add to allow the content to adjust to the size of the screen it's being viewed on? \nAs a photographer with a website to showcase my portfolio, its quite disappointing to have to work with a format that is stuck at the size it's been sized to and doesn't adjust to the screen size accordingly.\n\nCheers!","userEmail":"zopme@kicu.ma","creationTime":1516191466216},{"id":"cd4fbf3a-de0b-5e3a-8ec1-37ed072f0e91","title":"Filtering an array","content":"I have some code finding records with a queryreferenced function but I want to remove any records that have a live field of false so that I can add locations to the Items collection without them showing on the map straightaway.  The map is seen at abovedown.co.uk/map\nfunction getLocationsMap() {\n var iCat\n if ($w('#icategory').value.length > 0) {\n    iCat = $w('#icategory').value\n  } else {\n    iCat = \"e8dd0d65-dc99-4af1-9506-da1cd9beed38\"\n  }\n\n return wixData.queryReferenced(\"Category\", iCat, \"Items\")\n    .then((results) => {\n return results.items; // items is an array of locations from the collection\n    })\n    .catch((err) => {\n let errorMsg = err;\n    });\n\n}\nMay be I could filter them in the recieving code?\nfunction sendLocations() {\n  getLocationsMap()\n  .then((locations) => {\n\n let markers = [];\n for (let i = 0; i < locations.length; i++) {\n let loc = locations[i];\n      markers.push({title: loc.title, position: {lat: loc.lat, lng: loc.long}});\n    }\n    $w('#htmlMap').postMessage({markers});\n  });\n}\nAlso I don't understand why I need a return on the wixdata line and the results.items but if I remove either it no longer shows the locations on the map.  Your help is much appreciated.","userEmail":"duso@calo.ps","creationTime":1520211360358},{"id":"6860d043-f551-58c8-84d6-f9e6a8cb0cb2","title":"Search bar for my wix store","content":"hello Friends,\nCan anyone please help me in creating a search bar for my wix store page. So my customers could search any particular product from my wix store.\nThank you","userEmail":"sasi@ezougu.net","creationTime":1535854919274}]